[
  {
    "title": "Hot Chocolate Fudge",
    "keyIngredients": [
      "Chocolate Chips",
      "Heavy Cream",
      "Condensed Milk",
      "Vanilla Extract",
      "White Chocolate Chips",
      "Miniature Marshmallows",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xrysxr1483568462.jpg",
    "instructions": "Line an 8-inch-square baking pan with wax paper or foil, and coat with non-stick spray.\r\nIn a microwave-safe bowl, combine the dark chocolate chips, heavy cream and half of the sweetened condensed milk. Microwave the dark chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.\r\nAdd the vanilla extract to the dark chocolate mixture and stir well until smooth.\r\nTransfer the dark chocolate mixture into the prepared pan and spread into an even layer.\r\nIn a separate bowl, combine the white chocolate chips with the remaining half of the sweetened condensed milk. Microwave the white chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.\r\nEvenly spread the white chocolate mixture on top of dark chocolate layer.\r\nTop the chocolate layers with the Mallow Bits or miniature marshmallows, and gently press them down.\r\nRefrigerate for 4 hours, or until set.\r\nRemove the fudge and wax paper from the pan. Carefully peel all of the wax paper from the fudge.\r\nCut the fudge into bite-sized pieces and serve.",
    "isApproved": true
  },
  {
    "title": "Kentucky Fried Chicken",
    "keyIngredients": [
      "Chicken",
      "Oil",
      "Egg White",
      "Flour",
      "Brown Sugar",
      "Salt",
      "paprika",
      "onion salt",
      "chili powder",
      "black pepper",
      "celery salt",
      "sage",
      "garlic powder",
      "allspice",
      "oregano",
      "basil",
      "marjoram",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xqusqy1487348868.jpg",
    "instructions": "Preheat fryer to 350°F. Thoroughly mix together all the spice mix ingredients.\r\nCombine spice mix with flour, brown sugar and salt.\r\nDip chicken pieces in egg white to lightly coat them, then transfer to flour mixture. Turn a few times and make sure the flour mix is really stuck to the chicken. Repeat with all the chicken pieces.\r\nLet chicken pieces rest for 5 minutes so crust has a chance to dry a bit.\r\nFry chicken in batches. Breasts and wings should take 12-14 minutes, and legs and thighs will need a few more minutes. Chicken pieces are done when a meat thermometer inserted into the thickest part reads 165°F.\r\nLet chicken drain on a few paper towels when it comes out of the fryer. Serve hot.",
    "isApproved": true
  },
  {
    "title": "Coq au vin",
    "keyIngredients": [
      "Olive Oil",
      "Bacon",
      "Shallots",
      "Chicken Legs",
      "Chicken Thighs",
      "Chicken Breasts",
      "Garlic",
      "Brandy",
      "Red Wine",
      "Chicken Stock",
      "tomato puree",
      "thyme",
      "Rosemary",
      "bay leaves",
      "parsley",
      "chestnut mushroom",
      "plain flour",
      "butter",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/qstyvs1505931190.jpg",
    "instructions": "Heat 1 tbsp of the oil in a large, heavy-based saucepan or flameproof dish. Tip in the bacon and fry until crisp. Remove and drain on kitchen paper. Add the shallots to the pan and fry, stirring or shaking the pan often, for 5-8 mins until well browned all over. Remove and set aside with the bacon.\r\nPat the chicken pieces dry with kitchen paper. Pour the remaining oil into the pan, then fry half the chicken pieces, turning regularly, for 5-8 mins until well browned. Remove, then repeat with the remaining chicken. Remove and set aside.\r\nScatter in the garlic and fry briefly, then, with the heat medium-high, pour in the brandy or Cognac, stirring the bottom of the pan to deglaze. The alcohol should sizzle and start to evaporate so there is not much left.\r\nReturn the chicken legs and thighs to the pan along with any juices, then pour in a little of the wine, stirring the bottom of the pan again. Stir in the rest of the wine, the stock and tomato purée, drop in the bouquet garni, season with pepper and a pinch of salt, then return the bacon and shallots to the pan. Cover, lower the heat to a gentle simmer, add the chicken breasts and cook for 50 mins-1hr.\r\nJust before ready to serve, heat the oil for the mushrooms in a large non-stick frying pan. Add the mushrooms and fry over a high heat for a few mins until golden. Remove and keep warm.\r\nLift the chicken, shallots and bacon from the pan and transfer to a warmed serving dish. Remove the bouquet garni. To make the thickener, mix the flour, olive oil and butter in a small bowl using the back of a teaspoon. Bring the wine mixture to a gentle boil, then gradually drop in small pieces of the thickener, whisking each piece in using a wire whisk. Simmer for 1-2 mins. Scatter the mushrooms over the chicken, then pour over the wine sauce. Garnish with chopped parsley.",
    "isApproved": true
  },
  {
    "title": "Fettucine alfredo",
    "keyIngredients": [
      "Clotted Cream",
      "Butter",
      "Corn Flour",
      "Parmesan Cheese",
      "Nutmeg",
      "Fettuccine",
      "Parsley",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/uquqtu1511178042.jpg",
    "instructions": "In a medium saucepan, stir the clotted cream, butter and cornflour over a low-ish heat and bring to a low simmer. Turn off the heat and keep warm.\r\nMeanwhile, put the cheese and nutmeg in a small bowl and add a good grinding of black pepper, then stir everything together (don’t add any salt at this stage).\r\nPut the pasta in another pan with 2 tsp salt, pour over some boiling water and cook following pack instructions (usually 3-4 mins). When cooked, scoop some of the cooking water into a heatproof jug or mug and drain the pasta, but not too thoroughly.\r\nAdd the pasta to the pan with the clotted cream mixture, then sprinkle over the cheese and gently fold everything together over a low heat using a rubber spatula. When combined, splash in 3 tbsp of the cooking water. At first, the pasta will look wet and sloppy: keep stirring until the water is absorbed and the sauce is glossy. Check the seasoning before transferring to heated bowls. Sprinkle over some chives or parsley, then serve immediately.",
    "isApproved": true
  },
  {
    "title": "Split Pea Soup",
    "keyIngredients": [
      "Ham",
      "Peas",
      "Onions",
      "Carrots",
      "Bay Leaves",
      "Celery",
      "Frozen Peas",
      "Bread",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xxtsvx1511814083.jpg",
    "instructions": "Put the gammon in a very large pan with 2 litres water and bring to the boil. Remove from the heat and drain off the water – this helps to get rid of some of the saltiness. Recover with 2 litres cold water and bring to the boil again. Put everything but the frozen peas into the pan and bring to the boil. Reduce to a simmer and cook for 1½-2½ hrs, topping up the water as and when you need to, to a similar level it started at. As the ham cooks and softens, you can halve it if you want, so it is all submerged under the liquid. When the ham is tender enough to pull into shreds, it is ready.\r\nLift out the ham, peel off and discard the skin. While it is still hot (wear a clean pair of rubber gloves), shred the meat. Remove bay from the soup and stir in the frozen peas. Simmer for 1 min, then blend until smooth. Add a splash of water if too thick, and return to the pan to heat through if it has cooled, or if you are making ahead.\r\nWhen you are ready to serve, mix the hot soup with most of the ham – gently reheat if made ahead. Serve in bowls with the remaining ham scattered on top, and eat with crusty bread and butter.",
    "isApproved": true
  },
  {
    "title": "Full English Breakfast",
    "keyIngredients": [
      "Sausages",
      "Bacon",
      "Mushrooms",
      "Tomatoes",
      "Black Pudding",
      "Eggs",
      "Bread",
      "Baked Beans",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/sqrtwu1511721265.jpg",
    "instructions": "Heat the flat grill plate over a low heat, on top of 2 rings/flames if it fits, and brush sparingly with light olive oil.\r\nCook the sausages first. Add the sausages to the hot grill plate/the coolest part if there is one and allow to cook slowly for about 15-20 minutes, turning occasionally, until golden. After the first 10 minutes, increase the heat to medium before beginning to cook the other ingredients. If you are struggling for space, completely cook the sausages and keep hot on a plate in the oven.\r\nSnip a few small cuts into the fatty edge of the bacon. Place the bacon straight on to the grill plate and fry for 2-4 minutes each side or until your preferred crispiness is reached. Like the sausages, the cooked bacon can be kept hot on a plate in the oven.\r\nFor the mushrooms, brush away any dirt using a pastry brush and trim the stalk level with the mushroom top. Season with salt and pepper and drizzle over a little olive oil. Place stalk-side up on the grill plate and cook for 1-2 minutes before turning and cooking for a further 3-4 minutes. Avoid moving the mushrooms too much while cooking, as this releases the natural juices, making them soggy.\r\nFor the tomatoes, cut the tomatoes across the centre/or in half lengthways if using plum tomatoes , and with a small, sharp knife remove the green 'eye'. Season with salt and pepper and drizzle with a little olive oil. Place cut-side down on the grill plate and cook without moving for 2 minutes. Gently turn over and season again. Cook for a further 2-3 minutes until tender but still holding their shape.\r\nFor the black pudding, cut the black pudding into 3-4 slices and remove the skin. Place on the grill plate and cook for 1½-2 minutes each side until slightly crispy.\r\nFor 'proper' fried bread it's best to cook it in a separate pan. Ideally, use bread that is a couple of days old. Heat a frying pan to a medium heat and cover the base with oil. Add the bread and cook for 2-3 minutes each side until crispy and golden. If the pan becomes too dry, add a little more oil. For a richer flavour, add a knob of butter after you turn the slice.\r\nFor the fried eggs, break the egg straight into the pan with the fried bread and leave for 30 seconds. Add a good knob of butter and lightly splash/baste the egg with the butter when melted. Cook to your preferred stage, season and gently remove with a fish slice.\r\nOnce all the ingredients are cooked, serve on warm plates and enjoy straight away with a good squeeze of tomato ketchup or brown sauce.",
    "isApproved": true
  },
  {
    "title": "Christmas Pudding Flapjack",
    "keyIngredients": [
      "salted butter",
      "dark soft brown sugar",
      "golden syrup",
      "orange",
      "rolled oats",
      "Christmas pudding",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/vvusxs1483907034.jpg",
    "instructions": "Preheat the oven to 180°C/fan 160°C/gas mark 4 and grease and line a 25cm x 20cm tin. Melt the butter, sugar, syrup and orange zest in a large saucepan over a medium heat. The aim is to dissolve all the ingredients so that they are smooth, but to not lose any volume through boiling so be careful not to overheat.\r\n\r\nAdd the oats and stir well until evenly coated. Stir through the leftover Christmas pudding and tip into the prepared tin. Use a spoon to flatten the top and bake for 40 minutes until the edges start to brown. Whilst still warm in the tin, score into 12 squares. Allow to cool completely before cutting along the scores.\r\n\r\nKeeps for 5 days in an air tight tin or freeze for up to 1 month.",
    "isApproved": true
  },
  {
    "title": "Peach & Blueberry Grunt",
    "keyIngredients": [
      "Corn Flour",
      "Orange",
      "Orange",
      "Caster Sugar",
      "Peaches",
      "Blueberries",
      "Self-raising Flour",
      "Butter",
      "Muscovado Sugar",
      "Cinnamon",
      "Milk",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/ssxvup1511387476.jpg",
    "instructions": "Heat oven to 190C/170C fan/gas 5. Butter a wide shallow ovenproof dish. Blend the cornflour with the orange zest and juice, and put in a large pan with the sugar. Halve, stone and slice the peaches and add to the pan. Bring slowly to the boil, stirring gently until the sauce is shiny and thickened, about 3-4 mins. Remove from the heat, stir in the blueberries and tip into the prepared dish.\r\nTip the flour into a mixing bowl and add the 50g butter. Rub the butter into the flour until it resembles fine breadcrumbs, then stir in half the sugar. Mix the remaining sugar with the cinnamon and set aside.\r\nAdd the milk to the dry ingredients and mix to a soft dough. Turn out onto a lightly floured surface and knead briefly. Roll out to an oblong roughly 16 x 24cm. Brush with melted butter and sprinkle evenly with the spicy sugar. Roll up from one long side and cut into 12 slices. Arrange around the top of the dish, leaving the centre uncovered.\r\nBake for 20-25 mins, until the topping is crisp and golden. Serve warm.",
    "isApproved": true
  },
  {
    "title": "Cream Cheese Tart",
    "keyIngredients": [
      "Flour",
      "Butter",
      "Egg",
      "Salt",
      "Cheese",
      "Milk",
      "Eggs",
      "Parmesan Cheese",
      "Plum tomatoes",
      "White Vinegar",
      "Honey",
      "Basil",
      "",
      "",
      "",
      null,
      null,
      null,
      null,
      null
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wurrux1468416624.jpg",
    "instructions": "Crust: make a dough from 250g flour (I like mixing different flours like plain and wholegrain spelt flour), 125g butter, 1 egg and a pinch of salt, press it into a tart form and place it in the fridge. Filling: stir 300g cream cheese and 100ml milk until smooth, add in 3 eggs, 100g grated parmesan cheese and season with salt, pepper and nutmeg. Take the crust out of the fridge and prick the bottom with a fork. Pour in the filling and bake at 175 degrees C for about 25 minutes. Cover the tart with some aluminium foil after half the time. In the mean time, slice about 350g mini tomatoes. In a small pan heat 3tbsp olive oil, 3tbsp white vinegar, 1 tbsp honey, salt and pepper and combine well. Pour over the tomato slices and mix well. With a spoon, place the tomato slices on the tart, avoiding too much liquid on it. Decorate with basil leaves and enjoy",
    "isApproved": true
  },
  {
    "title": "Minced Beef Pie",
    "keyIngredients": [
      "Vegetable Oil",
      "Minced Beef",
      "Onion",
      "Tomato Puree",
      "Plain Flour",
      "Mushrooms",
      "Beef Stock",
      "Worcestershire Sauce",
      "Shortcrust Pastry",
      "Egg Yolks",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xwutvy1511555540.jpg",
    "instructions": "Preheat the oven to 200C/400F/Gas 6.\r\nHeat the oil in a deep frying pan and fry the beef mince for 4-5 minutes, breaking it up with a wooden spoon as it browns.\r\nAdd the onion and cook for 2-3 minutes, then stir in the tomato purée and cook for 2-3 more minutes. Stir in the flour and cook for a further minute, then add the chopped mushrooms, the stout or beef stock and a couple of dashes of Worcestershire sauce. Bring to the boil, then reduce the heat, cover the pan with a lid and leave to simmer for 20 minutes. Set aside and leave to cool, then turn the meat mixture into a one litre pie dish.\r\nRoll out the pastry on a floured work surface until it is slightly larger than the pie dish. Gently drape the pastry over the dish, pressing firmly onto the edges. Trim, then shape the edges into a fluted shape.\r\nCut some leaf shapes out of the pastry trimmings and decorate the top of the pie, sticking them to the pastry with the beaten egg yolk.\r\nMake three or four slits in the pastry to allow the steam to escape, then brush the pie with the rest of the beaten egg yolk and bake in the oven for 20-25 minutes, or until golden-brown.\r\nTo serve, slice into wedges.",
    "isApproved": true
  },
  {
    "title": "Parkin Cake",
    "keyIngredients": [
      "Butter",
      "Egg",
      "Milk",
      "Golden Syrup",
      "Black Treacle",
      "Brown Sugar",
      "Oatmeal",
      "Self-raising Flour",
      "Ground Ginger",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/qxuqtt1511724269.jpg",
    "instructions": "Heat oven to 160C/140C fan/gas 3. Grease a deep 22cm/9in square cake tin and line with baking parchment. Beat the egg and milk together with a fork.\r\n\r\nGently melt the syrup, treacle, sugar and butter together in a large pan until the sugar has dissolved. Remove from the heat. Mix together the oatmeal, flour and ginger and stir into the syrup mixture, followed by the egg and milk.\r\n\r\nPour the mixture into the tin and bake for 50 mins - 1 hr until the cake feels firm and a little crusty on top. Cool in the tin then wrap in more parchment and foil and keep for 3-5 days before eating if you can – it’ll become softer and stickier the longer you leave it, up to 2 weeks.\r\n",
    "isApproved": true
  },
  {
    "title": "Katsu Chicken curry",
    "keyIngredients": [
      "chicken breast",
      "plain flour",
      "egg",
      "breadcrumbs",
      "vegetable oil",
      "sunflower oil",
      "onions",
      "garlic",
      "carrot",
      "plain flour",
      "curry powder",
      "chicken stock",
      "honey",
      "soy sauce",
      "bay leaf",
      "garam masala",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/vwrpps1503068729.jpg",
    "instructions": "Prep:15min  ›  Cook:30min  ›  Ready in:45min \r\n\r\nFor the curry sauce: Heat oil in medium non-stick saucepan, add onion and garlic and cook until softened. Stir in carrots and cook over low heat for 10 to 12 minutes.\r\nAdd flour and curry powder; cook for 1 minute. Gradually stir in stock until combined; add honey, soy sauce and bay leaf. Slowly bring to the boil.\r\nTurn down heat and simmer for 20 minutes or until sauce thickens but is still of pouring consistency. Stir in garam masala. Pour the curry sauce through a sieve; return to saucepan and keep on low heat until ready to serve.\r\nFor the chicken: Season both sides of chicken breasts with salt and pepper. Place flour, egg and breadcrumbs in separate bowls and arrange in a row. Coat the chicken breasts in flour, then dip them into the egg, then coat in breadcrumbs, making sure you cover both sides.\r\nHeat oil in large frying pan over medium-high heat. Place chicken into hot oil and cook until golden brown, about 3 or 4 minutes each side. Once cooked, place on kitchen paper to absorb excess oil.\r\nPour curry sauce over chicken, serve with white rice and enjoy!",
    "isApproved": true
  },
  {
    "title": "Apple Frangipan Tart",
    "keyIngredients": [
      "digestive biscuits",
      "butter",
      "Bramley apples",
      "butter, softened",
      "caster sugar",
      "free-range eggs, beaten",
      "ground almonds",
      "almond extract",
      "flaked almonds",
      "",
      "",
      "",
      "",
      "",
      "",
      null,
      null,
      null,
      null,
      null
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wxywrq1468235067.jpg",
    "instructions": "Preheat the oven to 200C/180C Fan/Gas 6.\r\nPut the biscuits in a large re-sealable freezer bag and bash with a rolling pin into fine crumbs. Melt the butter in a small pan, then add the biscuit crumbs and stir until coated with butter. Tip into the tart tin and, using the back of a spoon, press over the base and sides of the tin to give an even layer. Chill in the fridge while you make the filling.\r\nCream together the butter and sugar until light and fluffy. You can do this in a food processor if you have one. Process for 2-3 minutes. Mix in the eggs, then add the ground almonds and almond extract and blend until well combined.\r\nPeel the apples, and cut thin slices of apple. Do this at the last minute to prevent the apple going brown. Arrange the slices over the biscuit base. Spread the frangipane filling evenly on top. Level the surface and sprinkle with the flaked almonds.\r\nBake for 20-25 minutes until golden-brown and set.\r\nRemove from the oven and leave to cool for 15 minutes. Remove the sides of the tin. An easy way to do this is to stand the tin on a can of beans and push down gently on the edges of the tin.\r\nTransfer the tart, with the tin base attached, to a serving plate. Serve warm with cream, crème fraiche or ice cream.",
    "isApproved": true
  },
  {
    "title": "Teriyaki Chicken Casserole",
    "keyIngredients": [
      "soy sauce",
      "water",
      "brown sugar",
      "ground ginger",
      "minced garlic",
      "cornstarch",
      "chicken breasts",
      "stir-fry vegetables",
      "brown rice",
      "",
      "",
      "",
      "",
      "",
      "",
      null,
      null,
      null,
      null,
      null
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wvpsxx1468256321.jpg",
    "instructions": "Preheat oven to 350° F. Spray a 9x13-inch baking pan with non-stick spray.\r\nCombine soy sauce, ½ cup water, brown sugar, ginger and garlic in a small saucepan and cover. Bring to a boil over medium heat. Remove lid and cook for one minute once boiling.\r\nMeanwhile, stir together the corn starch and 2 tablespoons of water in a separate dish until smooth. Once sauce is boiling, add mixture to the saucepan and stir to combine. Cook until the sauce starts to thicken then remove from heat.\r\nPlace the chicken breasts in the prepared pan. Pour one cup of the sauce over top of chicken. Place chicken in oven and bake 35 minutes or until cooked through. Remove from oven and shred chicken in the dish using two forks.\r\n*Meanwhile, steam or cook the vegetables according to package directions.\r\nAdd the cooked vegetables and rice to the casserole dish with the chicken. Add most of the remaining sauce, reserving a bit to drizzle over the top when serving. Gently toss everything together in the casserole dish until combined. Return to oven and cook 15 minutes. Remove from oven and let stand 5 minutes before serving. Drizzle each serving with remaining sauce. Enjoy!",
    "isApproved": true
  },
  {
    "title": "Rock Cakes",
    "keyIngredients": [
      "Self-raising Flour",
      "Caster Sugar",
      "Baking Powder",
      "Butter",
      "Dried Fruit",
      "Eggs",
      "Milk",
      "Vanilla Extract",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/tqrrsq1511723764.jpg",
    "instructions": "Preheat oven to 180C/350F/Gas 4 and line a baking tray with baking parchment.\r\nMix the flour, sugar and baking powder in a bowl and rub in the cubed butter until the mixture looks like breadcrumbs, then mix in the dried fruit.\r\nIn a clean bowl, beat the egg and milk together with the vanilla extract.\r\nAdd the egg mixture to the dry ingredients and stir with a spoon until the mixture just comes together as a thick, lumpy dough. Add a teaspoon more milk if you really need it to make the mixture stick together.\r\nPlace golfball-sized spoons of the mixture onto the prepared baking tray. Leave space between them as they will flatten and spread out to double their size during baking.\r\nBake for 15-20 minutes, until golden-brown. Remove from the oven, allow to cool for a couple of minutes then turn them out onto a wire rack to cool.",
    "isApproved": true
  },
  {
    "title": "Fettucine alfredo",
    "keyIngredients": [
      "Clotted Cream",
      "Butter",
      "Corn Flour",
      "Parmesan Cheese",
      "Nutmeg",
      "Fettuccine",
      "Parsley",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/uquqtu1511178042.jpg",
    "instructions": "In a medium saucepan, stir the clotted cream, butter and cornflour over a low-ish heat and bring to a low simmer. Turn off the heat and keep warm.\r\nMeanwhile, put the cheese and nutmeg in a small bowl and add a good grinding of black pepper, then stir everything together (don’t add any salt at this stage).\r\nPut the pasta in another pan with 2 tsp salt, pour over some boiling water and cook following pack instructions (usually 3-4 mins). When cooked, scoop some of the cooking water into a heatproof jug or mug and drain the pasta, but not too thoroughly.\r\nAdd the pasta to the pan with the clotted cream mixture, then sprinkle over the cheese and gently fold everything together over a low heat using a rubber spatula. When combined, splash in 3 tbsp of the cooking water. At first, the pasta will look wet and sloppy: keep stirring until the water is absorbed and the sauce is glossy. Check the seasoning before transferring to heated bowls. Sprinkle over some chives or parsley, then serve immediately.",
    "isApproved": true
  },
  {
    "title": "Choc Chip Pecan Pie",
    "keyIngredients": [
      "Plain Flour",
      "Butter",
      "Cream Cheese",
      "Icing Sugar",
      "Butter",
      "Maple Syrup",
      "Light Brown Soft Sugar",
      "Dark Brown Soft Sugar",
      "Eggs",
      "Vanilla Extract",
      "Pecan Nuts",
      "Dark Chocolate Chips",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/rqvwxt1511384809.jpg",
    "instructions": "First, make the pastry. Tip the ingredients into a food processor with 1 /4 tsp salt. Blend until the mixture resembles breadcrumbs. Drizzle 2-3 tsp cold water into the funnel while the blade is running – the mixture should start to clump together. Tip onto a work surface and bring together, kneading briefly into a ball. Pat into a disc, wrap in cling film, and chill for at least 20 mins. Heat oven to 200C/180C fan/gas 6.\r\n\r\nRemove the pastry from the fridge and leave at room temperature for 5 mins to soften. Flour the work surface, then unwrap the pastry and roll to a circle the thickness of a £1 coin. Use the pastry to line a deep, 23cm round fluted tin – mine was about 3cm deep. Press the pastry into the corners and up the sides, making sure there are no gaps. Leave 1cm pastry overhanging (save some of the pastry scraps for later). Line with baking parchment (scrunch it up first to make it more pliable) and fill with baking beans. Blind-bake for 15-20 mins until the sides are set, then remove the parchment and beans and return to the oven for 5 mins until golden brown. Trim the pastry so it’s flush with the top of the tin – a small serrated knife is best for this. If there are any cracks, patch them up with the pastry scraps.\r\n\r\nMeanwhile, weigh the butter, syrup and sugars into a pan, and add 1 /4 tsp salt. Heat until the butter has melted and the sugar dissolved, stirring until smooth. Remove from the heat and cool for 10 mins. Reduce oven to 160C/140C fan/gas 3.\r\n\r\nBeat the eggs in a bowl. Add the syrup mixture, vanilla and pecans, and mix until well combined. Pour half the mixture into the tart case, scatter over half the chocolate chips, then cover with the remaining filling and chocolate chips. Bake on the middle shelf for 50-55 mins until set. Remove from the oven and leave to cool, then chill for at least 2 hrs before serving.",
    "isApproved": true
  },
  {
    "title": "Beef and Mustard Pie",
    "keyIngredients": [
      "Beef",
      "Plain Flour",
      "Rapeseed Oil",
      "Red Wine",
      "Beef Stock",
      "Onion",
      "Carrots",
      "Thyme",
      "Mustard",
      "Egg Yolks",
      "Puff Pastry",
      "Green Beans",
      "Butter",
      "Salt",
      "Pepper",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/sytuqu1511553755.jpg",
    "instructions": "Preheat the oven to 150C/300F/Gas 2.\r\nToss the beef and flour together in a bowl with some salt and black pepper.\r\nHeat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole.\r\nFry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef.\r\nReturn the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper.\r\nCover with a lid and place in the oven for two hours.\r\nRemove from the oven, check the seasoning and set aside to cool. Remove the thyme.\r\nWhen the beef is cool and you're ready to assemble the pie, preheat the oven to 200C/400F/Gas 6.\r\nTransfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg.\r\nTrim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through.\r\nFor the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender.\r\nDrain and toss with the butter, then season with black pepper.\r\nTo serve, place a large spoonful of pie onto each plate with some green beans alongside.",
    "isApproved": true
  },
  {
    "title": "Chicken Karaage",
    "keyIngredients": [
      "Chicken thigh",
      "Ginger",
      "Garlic",
      "Soy sauce",
      "Sake",
      "Granulated sugar",
      "Potato starch",
      "Vegetable oil",
      "Lemon",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/tyywsw1505930373.jpg",
    "instructions": "Add the ginger, garlic, soy sauce, sake and sugar to a bowl and whisk to combine. Add the chicken, then stir to coat evenly. Cover and refrigerate for at least 1 hour.\r\n\r\nAdd 1 inch of vegetable oil to a heavy bottomed pot and heat until the oil reaches 360 degrees F. Line a wire rack with 2 sheets of paper towels and get your tongs out. Put the potato starch in a bowl\r\n\r\nAdd a handful of chicken to the potato starch and toss to coat each piece evenly.\r\n\r\nFry the karaage in batches until the exterior is a medium brown and the chicken is cooked through. Transfer the fried chicken to the paper towel lined rack. If you want the karaage to stay crispy longer, you can fry the chicken a second time, until it's a darker color after it's cooled off once. Serve with lemon wedges.",
    "isApproved": true
  },
  {
    "title": "Lamb Biryani",
    "keyIngredients": [
      "Cashew nuts",
      "Khus khus",
      "Cumin seeds",
      "Onions",
      "Ginger garlic paste",
      "Garlic",
      "Mint",
      "Cilantro",
      "Saffron",
      "Ghee",
      "Basmati rice",
      "Full fat yogurt",
      "Cumin Seeds",
      "Bay leaf",
      "Cinnamon",
      "Cloves",
      "Cardamom",
      "Lamb",
      "Red Chilli powder",
      "Biryani masala"
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xrttsx1487339558.jpg",
    "instructions": "Grind the cashew, poppy seeds and cumin seeds into a smooth paste, using as little water as possible. Set aside. \r\n\r\nDeep fry the sliced onions when it is hot. Don’t overcrowd the oil. When the onions turn light brown, remove from oil and drain on paper towel. The fried onion will crisp up as it drains. Also fry the cashewnuts till golden brown. Set aside.\r\n\r\nWash the rice and soak in water for twenty minutes.\r\nMeanwhile, take a big wide pan, add oil in medium heat, add the sliced onions, add the blended paste, to it add the green chillies, ginger garlic paste and garlic and fry for a minute.\r\nThen add the tomatoes and sauté them well till they are cooked and not mushy.\r\n\r\nThen to it add the red chilli powder, biryani powder, mint, coriander leaves and sauté them well.\r\nAdd the yogurt and mix well. I always move the skillet away from the heat when adding yogurt which prevents it from curdling.\r\n\r\nNow after returning the skillet back to the stove, add the washed lamb and salt and ½ cup water and mix well. Cook for 1 hour and cook it covered in medium low heat or put it in a pressure cooker for 6 whistles. If the water is not drained totally, heat it by keeping it open.\r\n\r\nTake another big pan, add thrice the cup of rice you use, and boil it. When it is boiling high, add the rice, salt and jeera and mix well. After 7 minutes exact or when the rice is 80% done. Switch off and drain the rice.\r\n\r\nNow, the layering starts. To the lamb, pat and level it. Add the drained hot rice on the top of it. Garnish with fried onions, ghee, mint, coriander leaves and saffron dissolved in milk.\r\n\r\nCover the dish and bake in a 350f oven for 15 minutes or till the cooked but not mushy. Or cook in the stove medium heat for 12 minutes and lowest heat for 5 minutes. And switch off. Mix and serve hot!\r\nNotes\r\n1. If you are cooking in oven, do make sure to cook in a big oven safe pan and cover it tight and then keep in oven for the final step.\r\n2. You can skip biryani masala if you don’t have and add just garam masala (1 tsp and red chilli powder – 3 tsp instead of 1 tsp)\r\n3. If it is spicy in the end, squeeze some lemon, it will reduce the heat and enhance the flavors also.",
    "isApproved": true
  },
  {
    "title": "BeaverTails",
    "keyIngredients": [
      "Water",
      "Yeast",
      "Sugar",
      "Milk",
      "Butter",
      "Eggs",
      "Salt",
      "Flour",
      "Oil",
      "Lemon",
      "Sugar",
      "Cinnamon",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/ryppsv1511815505.jpg",
    "instructions": "In the bowl of a stand mixer, add warm water, a big pinch of sugar and yeast. Allow to sit until frothy.\r\nInto the same bowl, add 1/2 cup sugar, warm milk, melted butter, eggs and salt, and whisk until combined.\r\nPlace a dough hook on the mixer, add the flour with the machine on, until a smooth but slightly sticky dough forms.\r\nPlace dough in a bowl, cover with plastic wrap, and allow to proof for 1 1/2 hours.\r\nCut dough into 12 pieces, and roll out into long oval-like shapes about 1/4 inch thick that resemble a beaver’s tail.\r\nIn a large, deep pot, heat oil to 350 degrees. Gently place beavertail dough into hot oil and cook for 30 to 45 seconds on each side until golden brown.\r\nDrain on paper towels, and garnish as desired. Toss in cinnamon sugar, in white sugar with a squeeze of lemon, or with a generous slathering of Nutella and a handful of toasted almonds. Enjoy!",
    "isApproved": true
  },
  {
    "title": "Tandoori chicken",
    "keyIngredients": [
      "lemons",
      "paprika",
      "red onions",
      "chicken thighs",
      "vegetable oil",
      "Greek yogurt",
      "ginger",
      "garlic clove",
      "garam masala",
      "ground cumin",
      "chilli powder",
      "turmeric",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/qptpvt1487339892.jpg",
    "instructions": "Mix the lemon juice with the paprika and red onions in a large shallow dish. Slash each chicken thigh three times, then turn them in the juice and set aside for 10 mins.\r\nMix all of the marinade ingredients together and pour over the chicken. Give everything a good mix, then cover and chill for at least 1 hr. This can be done up to a day in advance.\r\nHeat the grill. Lift the chicken pieces onto a rack over a baking tray. Brush over a little oil and grill for 8 mins on each side or until lightly charred and completely cooked through.",
    "isApproved": true
  },
  {
    "title": "Recheado Masala Fish",
    "keyIngredients": [
      "Mackerel",
      "Red Chili",
      "Ginger",
      "Garlic",
      "Pepper",
      "Cumin",
      "Turmeric",
      "Cinnamon stick",
      "Clove",
      "Cardamom",
      "Sugar",
      "Tamarind ball",
      "Vinegar",
      "Oil",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/uwxusv1487344500.jpg",
    "instructions": "Soak all the spices, ginger, garlic, tamarind pulp and kashmiri chilies except oil in vinegar.\r\nAdd sugar and salt.\r\nAlso add turmeric powder.\r\nCombine all nicely and marinate for 35-40 mins.\r\nGrind the mixture until soft and smooth. Add more vinegar if required but ensure the paste has to be thick so add vinegar accordingly. If the masala paste is thin then it would not stick to the fish.\r\nRinse the fish slit from the center and give some incision from the top. You could see the fish below for clarity.\r\nNow stuff the paste into the center and into the incision. Coat the entire fish with this paste. Marinate the fish for 30 mins.\r\nPlace oil in a shallow pan, once oil is quite hot shallow fry the stuffed mackerels.\r\nFry until golden brown from both sides\r\nServe the recheado mackerels hot with salad, lime wedges, rice and curry.\r\nNotes\r\n1. Ensure the masala paste is thick else the result won't be good.\r\n2. If you aren't able to find kashmiri chilies then use bedgi chilies or kashmiri red chili powder.\r\n3. You could use white vinegar or coconut vinegar.\r\n4. Any left over paste could be stored in the fridge for future use.\r\n5. Cinnamon could be avoided as it's a strong spice used generally for meat or chicken.",
    "isApproved": true
  },
  {
    "title": "Nutty Chicken Curry",
    "keyIngredients": [
      "Red Chilli",
      "Ginger",
      "Garlic",
      "Coriander",
      "Sunflower Oil",
      "Chicken Breasts",
      "Peanut Butter",
      "Chicken Stock",
      "Greek Yogurt",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/yxsurp1511304301.jpg",
    "instructions": "Finely slice a quarter of the chilli, then put the rest in a food processor with the ginger, garlic, coriander stalks and one-third of the leaves. Whizz to a rough paste with a splash of water if needed.\r\nHeat the oil in a frying pan, then quickly brown the chicken chunks for 1 min. Stir in the paste for another min, then add the peanut butter, stock and yogurt. When the sauce is gently bubbling, cook for 10 mins until the chicken is just cooked through and sauce thickened. Stir in most of the remaining coriander, then scatter the rest on top with the chilli, if using. Eat with rice or mashed sweet potato.",
    "isApproved": true
  },
  {
    "title": "Vegan Chocolate Cake",
    "keyIngredients": [
      "self raising flour",
      "coco sugar",
      "cacao",
      "baking powder",
      "flax eggs",
      "almond milk",
      "vanilla",
      "water",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/qxutws1486978099.jpg",
    "instructions": "Simply mix all dry ingredients with wet ingredients and blend altogether. Bake for 45 min on 180 degrees. Decorate with some melted vegan chocolate ",
    "isApproved": true
  },
  {
    "title": "Vegan Lasagna",
    "keyIngredients": [
      "green red lentils",
      "carrot",
      "onion",
      "zucchini",
      "coriander",
      "spinach",
      "lasagne sheets",
      "vegan butter",
      "flour",
      "soya milk",
      "mustard",
      "vinegar",
      "",
      "",
      "",
      null,
      null,
      null,
      null,
      null
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/rvxxuy1468312893.jpg",
    "instructions": "1) Preheat oven to 180 degrees celcius. \r\n2) Boil vegetables for 5-7 minutes, until soft. Add lentils and bring to a gentle simmer, adding a stock cube if desired. Continue cooking and stirring until the lentils are soft, which should take about 20 minutes. \r\n3) Blanch spinach leaves for a few minutes in a pan, before removing and setting aside. \r\n4) Top up the pan with water and cook the lasagne sheets. When cooked, drain and set aside.\r\n5) To make the sauce, melt the butter and add the flour, then gradually add the soya milk along with the mustard and the vinegar. Cook and stir until smooth and then assemble the lasagne as desired in a baking dish. \r\n6) Bake in the preheated oven for about 25 minutes.",
    "isApproved": true
  },
  {
    "title": "Callaloo Jamaican Style",
    "keyIngredients": [
      "Kale",
      "Bacon",
      "Garlic",
      "Onion",
      "Paprika",
      "Thyme",
      "Tomato",
      "Red Pepper",
      "Banana",
      "Vegetable Oil",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/ussyxw1515364536.jpg",
    "instructions": "Cut leaves and soft stems from the kale branches, them soak in a bowl of cold water for about 5-10 minutes or until finish with prep.\r\nProceed to slicing the onions, mincing the garlic and dicing the tomatoes. Set aside\r\nRemove kale from water cut in chunks.\r\nPlace bacon on saucepan and cook until crispy. Then add onions, garlic, thyme, stir for about a minute or more\r\nAdd tomatoes; scotch bonnet pepper, smoked paprika. Sauté for about 2-3 more minutes.\r\nFinally add vegetable, salt, mix well, and steamed for about 6-8 minutes or until leaves are tender. Add a tiny bit of water as needed. Adjust seasonings and turn off the heat.\r\nUsing a sharp knife cut both ends off the plantain. This will make it easy to grab the skin of the plantains. Slit a shallow line down the long seam of the plantain; peel only as deep as the peel. Remove plantain peel by pulling it back.\r\nSlice the plantain into medium size lengthwise slices and set aside.\r\nCoat a large frying pan with cooking oil spray. Spray the tops of the plantains with a generous layer of oil spray and sprinkle with salt, freshly ground pepper.\r\nLet the plantains \"fry\" on medium heat, shaking the frying pan to redistribute them every few minutes.\r\nAs the plantains brown, continue to add more cooking oil spray, salt and pepper (if needed) until they have reached the desired color and texture.\r\nRemove and serve with kale",
    "isApproved": true
  },
  {
    "title": "Teriyaki Chicken Casserole",
    "keyIngredients": [
      "soy sauce",
      "water",
      "brown sugar",
      "ground ginger",
      "minced garlic",
      "cornstarch",
      "chicken breasts",
      "stir-fry vegetables",
      "brown rice",
      "",
      "",
      "",
      "",
      "",
      "",
      null,
      null,
      null,
      null,
      null
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wvpsxx1468256321.jpg",
    "instructions": "Preheat oven to 350° F. Spray a 9x13-inch baking pan with non-stick spray.\r\nCombine soy sauce, ½ cup water, brown sugar, ginger and garlic in a small saucepan and cover. Bring to a boil over medium heat. Remove lid and cook for one minute once boiling.\r\nMeanwhile, stir together the corn starch and 2 tablespoons of water in a separate dish until smooth. Once sauce is boiling, add mixture to the saucepan and stir to combine. Cook until the sauce starts to thicken then remove from heat.\r\nPlace the chicken breasts in the prepared pan. Pour one cup of the sauce over top of chicken. Place chicken in oven and bake 35 minutes or until cooked through. Remove from oven and shred chicken in the dish using two forks.\r\n*Meanwhile, steam or cook the vegetables according to package directions.\r\nAdd the cooked vegetables and rice to the casserole dish with the chicken. Add most of the remaining sauce, reserving a bit to drizzle over the top when serving. Gently toss everything together in the casserole dish until combined. Return to oven and cook 15 minutes. Remove from oven and let stand 5 minutes before serving. Drizzle each serving with remaining sauce. Enjoy!",
    "isApproved": true
  },
  {
    "title": "McSinghs Scotch pie",
    "keyIngredients": [
      "Cumin",
      "Rapeseed Oil",
      "Red Onions",
      "Garlic Clove",
      "Green Chilli",
      "Red Pepper",
      "Nutmeg",
      "Coriander",
      "Lamb Mince",
      "Pepper",
      "Coriander",
      "Plain Flour",
      "Salt",
      "Milk",
      "Lard",
      "Egg Yolks",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/vssrtx1511557680.jpg",
    "instructions": "Heat a large frying pan and toast the cumin seeds for a few minutes, then set aside. Heat the oil in the same pan and fry the onion, garlic, chilli, pepper and a good pinch of salt for around eight minutes, until there is no moisture left. Remove from the heat, stir in the toasted cumin seeds, ground mace (or nutmeg) and ground coriander. Leave to cool.\r\nIn a large bowl mix together the minced lamb, white pepper, fresh coriander, and the cooled spiced onion mixture until combined. Set aside, covered, in the fridge.\r\nPreheat the oven to 200C/400F/Gas 6 and generously grease a 20cm/8in diameter loose-bottomed or springform round cake tin with lard.\r\nTo make the pastry, sift the flour and salt in a large bowl and make a well in the centre.\r\nPut the milk, lard and 90ml/3fl oz of water in a saucepan and heat gently. When the lard has melted, increase the heat and bring to the boil.\r\nPour the boiling liquid into the flour, and use a wooden spoon to combine until cool enough to handle. Bring together into a ball.\r\nDust a work surface with flour and, working quickly, knead the dough briefly – it will be soft and moist. Set aside a third of the pastry and roll the rest out on a well-floured surface. Line the pie dish with the pastry, pressing it right up the sides until it pokes just over the top of the tin.\r\nAdd the filling into the pastry-lined tin bit by bit. As you reach the top, form a slight peak. Roll out the reserved pastry and top the pie with it. Pinch the edges to seal and trim the excess. Poke a hole in the top of the pie and insert a small tube made from aluminium foil to allow steam to escape.\r\nBrush the top of the pie with a little beaten egg yolk, and bake in the preheated oven for 30 minutes (put a tray on the shelf below to catch any drips). Then reduce the temperature to 160C/325F/Gas 3 and cook for a further 1¼ hours until golden-brown. Leave to cool completely before refrigerating for two hours, or overnight.\r\nRun a knife around the edge of the pie, remove from the tin and serve with chutneys, salads or pickles.",
    "isApproved": true
  },
  {
    "title": "Spotted Dick",
    "keyIngredients": [
      "Self-raising Flour",
      "Salt",
      "Suet",
      "Currants",
      "Caster Sugar",
      "Lemon",
      "Orange",
      "Milk",
      "Custard",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xqvyqr1511638875.jpg",
    "instructions": "Put the flour and salt in a bowl. Add the suet, currants, sugar, lemon and orange zest.\r\nPour in 150ml milk and mix to a firm but moist dough, adding the extra milk if necessary.\r\nShape into a fat roll about 20cm long. Place on a large rectangle of baking parchment. Wrap loosely to allow for the pudding to rise and tie the ends with string like a Christmas cracker.\r\nPlace a steamer over a large pan of boiling water, add the pudding to the steamer, cover and steam for 1 1/2 hours. Top up the pan with water from time to time.\r\nRemove from the steamer and allow to cool slightly before unwrapping. Serve sliced with custard.",
    "isApproved": true
  },
  {
    "title": "Duck Confit",
    "keyIngredients": [
      "Sea Salt",
      "Bay Leaf",
      "Garlic",
      "Thyme",
      "Duck Legs",
      "White Wine",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wvpvsu1511786158.jpg",
    "instructions": "The day before you want to make the dish, scatter half the salt, half the garlic and half of the herbs over the base of a small shallow dish. Lay the duck legs, skin-side up, on top, then scatter over the remaining salt, garlic and herbs. Cover the duck and refrigerate overnight. This can be done up to 2 days ahead.\r\nPour the wine into a saucepan that will snugly fit the duck legs in a single layer. Brush the salt off the duck legs and place them, skin-side down, in the wine. Cover the pan with a lid and place over a medium heat. As soon as the wine starts to bubble, turn the heat down to the lowest setting and cook for 2 hours, checking occasionally that the liquid is just barely simmering. (If you own a heat diffuser, it would be good to use it here.) After 2 hours, the duck legs should be submerged in their own fat and the meat should feel incredibly tender when prodded. Leave to cool.\r\nThe duck legs are now cooked and can be eaten immediately – or you can follow the next step if you like them crisp. If you are preparing ahead, pack the duck legs tightly into a plastic container or jar and pour over the fat, but not the liquid at the bottom of the pan. Cover and leave in the fridge for up to a month, or freeze for up to 3 months. The liquid you are left with makes a tasty gravy, which can be chilled or frozen until needed.\r\nTo reheat and crisp up the duck legs, heat oven to 220C/fan 200C/gas 7. Remove the legs from the fat and place them, skin-side down, in an ovenproof frying pan. Roast for 30-40 mins, turning halfway through, until brown and crisp. Serve with the reheated gravy, a crisp salad and some crisp golden ptoatoes.",
    "isApproved": true
  },
  {
    "title": "Chilli prawn linguine",
    "keyIngredients": [
      "Linguine Pasta",
      "Sugar Snap Peas",
      "Olive Oil",
      "Garlic Clove",
      "Red Chilli",
      "King Prawns",
      "Cherry Tomatoes",
      "Basil Leaves",
      "Lettuce",
      "Bread",
      "Fromage Frais",
      "Lime",
      "Caster Sugar",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/usywpp1511189717.jpg",
    "instructions": "Mix the dressing ingredients in a small bowl and season with salt and pepper. Set aside.\r\n\r\nCook the pasta according to the packet instructions. Add the sugar snap peas for the last minute or so of cooking time.\r\n\r\nMeanwhile, heat the oil in a wok or large frying pan, toss in the garlic and chilli and cook over a fairly gentle heat for about 30 seconds without letting the garlic brown. Tip in the prawns and cook over a high heat, stirring frequently, for about 3 minutes until they turn pink.\r\n\r\nAdd the tomatoes and cook, stirring occasionally, for 3 minutes until they just start to soften. Drain the pasta and sugar snaps well, then toss into the prawn mixture. Tear in the basil leaves, stir, and season with salt and pepper.\r\n\r\nServe with salad leaves drizzled with the lime dressing, and warm crusty bread.",
    "isApproved": true
  },
  {
    "title": "Chocolate Avocado Mousse",
    "keyIngredients": [
      "Banana",
      "Cacao",
      "Avocado",
      "Honey",
      "Lemon Juice",
      "Vanilla",
      "Water",
      "Sea Salt",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/uttuxy1511382180.jpg",
    "instructions": "1. Blend all the mousse ingredients together in your food processor until smooth. Add the cacao powder first and, as you blend, have all the ingredients to hand in order to adjust the ratios slightly as the size of avocados and bananas varies so much. The perfect ratio in order to avoid the dish tasting too much of either is to use equal amounts of both.\r\n\r\n2. Taste and add a few drops of stevia if you feel you need more sweetness.\r\n\r\n3. Fill little cups or shot glasses with the mousse, sprinkle with the cacao powder or nibs and serve.\r\n\r\nTip If you don’t have a frozen banana to hand you can just use a normal one and then chill the mousse before serving for a cooling dessert.",
    "isApproved": true
  },
  {
    "title": "Jam Roly-Poly",
    "keyIngredients": [
      "Butter",
      "Self-raising Flour",
      "Vanilla",
      "Suet",
      "Milk",
      "Raspberry Jam",
      "Custard",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/ysqupp1511640538.jpg",
    "instructions": "Put a deep roasting tin onto the bottom shelf of the oven, and make sure that there’s another shelf directly above it. Pull the roasting tin out on its shelf, fill two-thirds with boiling water from the kettle, then carefully slide it back in. Heat oven to 180C/160C fan/gas 4. Tear off a large sheet of foil and greaseproof paper (about 30 x 40cm). Sit the greaseproof on top of the foil and butter it.\r\nTip butter, flour and vanilla seeds into a food processor; pulse until the butter has disappeared. Tip into a mixing bowl. Stir through the suet, pour in the milk and work together with a cutlery knife until you get a sticky dough. You may need a drop more milk, depending on your flour.\r\nTip the dough out onto a floured surface, quickly pat together to smooth, then roll out to a square roughly 25 x 25cm. Spread the jam all over, leaving a gap along one edge, then roll up from the opposite edge. Pinch the jam-free edge into the dough where it meets, and pinch the ends roughly, too. Carefully lift onto the greased paper, join-side down (you might find a flat baking sheet helpful for this), loosely bring up the paper and foil around it, then scrunch together along the edges and ends to seal. The roly-poly will puff quite a bit during cooking so don’t wrap it tightly. Lift the parcel directly onto the rack above the tin and cook for 1 hr.\r\nLet the pudding sit for 5 mins before unwrapping, then carefully open the foil and paper, and thickly slice to serve.",
    "isApproved": true
  },
  {
    "title": "Brown Stew Chicken",
    "keyIngredients": [
      "Chicken",
      "Tomato",
      "Onions",
      "Garlic Clove",
      "Red Pepper",
      "Carrots",
      "Lime",
      "Thyme",
      "Allspice",
      "Soy Sauce",
      "Cornstarch",
      "Coconut Milk",
      "Vegetable Oil",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/sypxpx1515365095.jpg",
    "instructions": "Squeeze lime over chicken and rub well. Drain off excess lime juice.\r\nCombine tomato, scallion, onion, garlic, pepper, thyme, pimento and soy sauce in a large bowl with the chicken pieces. Cover and marinate at least one hour.\r\nHeat oil in a dutch pot or large saucepan. Shake off the seasonings as you remove each piece of chicken from the marinade. Reserve the marinade for sauce.\r\nLightly brown the chicken a few pieces at a time in very hot oil. Place browned chicken pieces on a plate to rest while you brown the remaining pieces.\r\nDrain off excess oil and return the chicken to the pan. Pour the marinade over the chicken and add the carrots. Stir and cook over medium heat for 10 minutes.\r\nMix flour and coconut milk and add to stew, stirring constantly. Turn heat down to minimum and cook another 20 minutes or until tender.",
    "isApproved": true
  },
  {
    "title": "Honey Teriyaki Salmon",
    "keyIngredients": [
      "Salmon",
      "Olive oil",
      "Soy Sauce",
      "Sake",
      "Sesame Seed",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      null,
      null,
      null,
      null,
      null
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xxyupu1468262513.jpg",
    "instructions": "Mix all the ingredients in the Honey Teriyaki Glaze together. Whisk to blend well. Combine the salmon and the Glaze together.\r\n\r\nHeat up a skillet on medium-low heat. Add the oil, Pan-fry the salmon on both sides until it’s completely cooked inside and the glaze thickens.\r\n\r\nGarnish with sesame and serve immediately.",
    "isApproved": true
  },
  {
    "title": "Nutty Chicken Curry",
    "keyIngredients": [
      "Red Chilli",
      "Ginger",
      "Garlic",
      "Coriander",
      "Sunflower Oil",
      "Chicken Breasts",
      "Peanut Butter",
      "Chicken Stock",
      "Greek Yogurt",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/yxsurp1511304301.jpg",
    "instructions": "Finely slice a quarter of the chilli, then put the rest in a food processor with the ginger, garlic, coriander stalks and one-third of the leaves. Whizz to a rough paste with a splash of water if needed.\r\nHeat the oil in a frying pan, then quickly brown the chicken chunks for 1 min. Stir in the paste for another min, then add the peanut butter, stock and yogurt. When the sauce is gently bubbling, cook for 10 mins until the chicken is just cooked through and sauce thickened. Stir in most of the remaining coriander, then scatter the rest on top with the chilli, if using. Eat with rice or mashed sweet potato.",
    "isApproved": true
  },
  {
    "title": "Vegan Chocolate Cake",
    "keyIngredients": [
      "self raising flour",
      "coco sugar",
      "cacao",
      "baking powder",
      "flax eggs",
      "almond milk",
      "vanilla",
      "water",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/qxutws1486978099.jpg",
    "instructions": "Simply mix all dry ingredients with wet ingredients and blend altogether. Bake for 45 min on 180 degrees. Decorate with some melted vegan chocolate ",
    "isApproved": true
  },
  {
    "title": "Shakshuka",
    "keyIngredients": [
      "Olive Oil",
      "Red Onions",
      "Red Chilli",
      "Garlic",
      "Coriander",
      "Cherry Tomatoes",
      "Caster Sugar",
      "Eggs",
      "Feta",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/g373701551450225.jpg",
    "instructions": "Heat the oil in a frying pan that has a lid, then soften the onions, chilli, garlic and coriander stalks for 5 mins until soft. Stir in the tomatoes and sugar, then bubble for 8-10 mins until thick. Can be frozen for 1 month.\r\n\r\nUsing the back of a large spoon, make 4 dips in the sauce, then crack an egg into each one. Put a lid on the pan, then cook over a low heat for 6-8 mins, until the eggs are done to your liking. Scatter with the coriander leaves and serve with crusty bread.",
    "isApproved": true
  },
  {
    "title": "Katsu Chicken curry",
    "keyIngredients": [
      "chicken breast",
      "plain flour",
      "egg",
      "breadcrumbs",
      "vegetable oil",
      "sunflower oil",
      "onions",
      "garlic",
      "carrot",
      "plain flour",
      "curry powder",
      "chicken stock",
      "honey",
      "soy sauce",
      "bay leaf",
      "garam masala",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/vwrpps1503068729.jpg",
    "instructions": "Prep:15min  ›  Cook:30min  ›  Ready in:45min \r\n\r\nFor the curry sauce: Heat oil in medium non-stick saucepan, add onion and garlic and cook until softened. Stir in carrots and cook over low heat for 10 to 12 minutes.\r\nAdd flour and curry powder; cook for 1 minute. Gradually stir in stock until combined; add honey, soy sauce and bay leaf. Slowly bring to the boil.\r\nTurn down heat and simmer for 20 minutes or until sauce thickens but is still of pouring consistency. Stir in garam masala. Pour the curry sauce through a sieve; return to saucepan and keep on low heat until ready to serve.\r\nFor the chicken: Season both sides of chicken breasts with salt and pepper. Place flour, egg and breadcrumbs in separate bowls and arrange in a row. Coat the chicken breasts in flour, then dip them into the egg, then coat in breadcrumbs, making sure you cover both sides.\r\nHeat oil in large frying pan over medium-high heat. Place chicken into hot oil and cook until golden brown, about 3 or 4 minutes each side. Once cooked, place on kitchen paper to absorb excess oil.\r\nPour curry sauce over chicken, serve with white rice and enjoy!",
    "isApproved": true
  },
  {
    "title": "Three Fish Pie",
    "keyIngredients": [
      "Potatoes",
      "Butter",
      "Milk",
      "Gruyère",
      "Butter",
      "Leek",
      "Plain Flour",
      "White Wine",
      "Milk",
      "Parsley",
      "Salmon",
      "Haddock",
      "Smoked Haddock",
      "Eggs",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/spswqs1511558697.jpg",
    "instructions": "Preheat the oven to 200C/400F/Gas 6 (180C fan).\r\nPut the potatoes into a saucepan of cold salted water. Bring up to the boil and simmer until completely tender. Drain well and then mash with the butter and milk. Add pepper and taste to check the seasoning. Add salt and more pepper if necessary.\r\nFor the fish filling, melt the butter in a saucepan, add the leeks and stir over the heat. Cover with a lid and simmer gently for 10 minutes, or until soft. Measure the flour into a small bowl. Add the wine and whisk together until smooth.\r\nAdd the milk to the leeks, bring to the boil and then add the wine mixture. Stir briskly until thickened. Season and add the parsley and fish. Stir over the heat for two minutes, then spoon into an ovenproof casserole. Scatter over the eggs. Allow to cool until firm.\r\nSpoon the mashed potatoes over the fish mixture and mark with a fork. Sprinkle with cheese.\r\nBake for 30-40 minutes, or until lightly golden-brown on top and bubbling around the edges.",
    "isApproved": true
  },
  {
    "title": "Bread and Butter Pudding",
    "keyIngredients": [
      "butter",
      "bread",
      "sultanas",
      "cinnamon",
      "milk",
      "double cream",
      "eggs",
      "sugar",
      "nutmeg",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xqwwpy1483908697.jpg",
    "instructions": "Grease a 1 litre/2 pint pie dish with butter.\r\nCut the crusts off the bread. Spread each slice with on one side with butter, then cut into triangles.\r\nArrange a layer of bread, buttered-side up, in the bottom of the dish, then add a layer of sultanas. Sprinkle with a little cinnamon, then repeat the layers of bread and sultanas, sprinkling with cinnamon, until you have used up all of the bread. Finish with a layer of bread, then set aside.\r\nGently warm the milk and cream in a pan over a low heat to scalding point. Don't let it boil.\r\nCrack the eggs into a bowl, add three quarters of the sugar and lightly whisk until pale.\r\nAdd the warm milk and cream mixture and stir well, then strain the custard into a bowl.\r\nPour the custard over the prepared bread layers and sprinkle with nutmeg and the remaining sugar and leave to stand for 30 minutes.\r\nPreheat the oven to 180C/355F/Gas 4.\r\nPlace the dish into the oven and bake for 30-40 minutes, or until the custard has set and the top is golden-brown.",
    "isApproved": true
  },
  {
    "title": "Venetian Duck Ragu",
    "keyIngredients": [
      "Olive Oil",
      "Duck Legs",
      "Onions",
      "Garlic",
      "Cinnamon",
      "Plain Flour",
      "Red Wine",
      "Chopped Tomatoes",
      "Chicken Stock Cube",
      "Rosemary",
      "Bay Leaves",
      "Sugar",
      "Milk",
      "Paccheri Pasta",
      "Parmesan Cheese",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/qvrwpt1511181864.jpg",
    "instructions": "Heat the oil in a large pan. Add the duck legs and brown on all sides for about 10 mins. Remove to a plate and set aside. Add the onions to the pan and cook for 5 mins until softened. Add the garlic and cook for a further 1 min, then stir in the cinnamon and flour and cook for a further min. Return the duck to the pan, add the wine, tomatoes, stock, herbs, sugar and seasoning. Bring to a simmer, then lower the heat, cover with a lid and cook for 2 hrs, stirring every now and then.\r\nCarefully lift the duck legs out of the sauce and place on a plate – they will be very tender so try not to lose any of the meat. Pull off and discard the fat, then shred the meat with 2 forks and discard the bones. Add the meat back to the sauce with the milk and simmer, uncovered, for a further 10-15 mins while you cook the pasta.\r\nCook the pasta following pack instructions, then drain, reserving a cup of the pasta water, and add the pasta to the ragu. Stir to coat all the pasta in the sauce and cook for 1 min more, adding a splash of cooking liquid if it looks dry. Serve with grated Parmesan, if you like.",
    "isApproved": true
  },
  {
    "title": "Dundee cake",
    "keyIngredients": [
      "Almonds",
      "Butter",
      "Muscovado Sugar",
      "Orange",
      "Apricot Jam",
      "Plain Flour",
      "Baking Powder",
      "Eggs",
      "Ground Almonds",
      "Milk",
      "Dried Fruit",
      "Glace Cherry",
      "Milk",
      "Caster Sugar",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wxyvqq1511723401.jpg",
    "instructions": "Put the almonds into a small bowl and pour over boiling water to just cover. Leave for 5 mins then drain in a sieve and leave to dry.\r\nPreheat the oven to 180C/160 C fan/Gas Mark 4. Line a deep loose-based 20cm cake tin with baking parchment.\r\nPut the butter in a large bowl and beat well until soft. Add the sugar and beat until light and fluffy. Stir in the orange zest and apricot jam.\r\nSieve together the flour and baking powder. Add the eggs to the creamed butter and sugar, a little at a time, beating well between each addition. If the mixture starts to curdle, stir in a little flour.\r\nAdd the remaining flour and ground almonds and mix well. Mix in the milk and then add the dried fruit and cherries and mix gently together.\r\nSpoon the mixture into the prepared tin and spread level using the back of a spoon. Arrange the whole almonds close together in neat circles on the top of the cake. Bake in the oven for 45 mins.\r\nLower the oven temperature to 160C/140 C fan/Gas Mark 3 and cook for a further 60–80 minutes. Check the cake after 50 minutes by inserting a wooden or metal skewer into the cake. When it’s done it should have just a few crumbs attached. Check every 10 minutes - it’s important not to overcook this cake so the centre will be a little soft.\r\nWhen cooked, remove the cake briefly from the oven, put the milk and sugar into a small pan and heat gently until the sugar has dissolved. Brush over the top of the cake and return the cake to the oven for 2-3 mins. Remove and allow the cake to cool in the tin. When quite cold remove from the tin and wrap in foil and keep for at least 2 days before cutting.",
    "isApproved": true
  },
  {
    "title": "Brie wrapped in prosciutto & brioche",
    "keyIngredients": [
      "Plain Flour",
      "Caster Sugar",
      "Yeast",
      "Milk",
      "Eggs",
      "Eggs",
      "Butter",
      "Brie",
      "Prosciutto",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/qqpwsy1511796276.jpg",
    "instructions": "Mix the flour, 1 tsp salt, caster sugar, yeast, milk and eggs together in a mixer using the dough attachment for 5 mins until the dough is smooth. Add the butter and mix for a further 4 mins on medium speed. Scrape the dough bowl and mix again for 1 min. Place the dough in a container, cover with cling film and leave in the fridge for at least 6 hrs before using.\r\nWrap the Brie in the prosciutto and set aside. Turn out the dough onto a lightly floured surface. Roll into a 25cm circle. Place the wrapped Brie in the middle of the circle and fold the edges in neatly. Put the parcel onto a baking tray lined with baking parchment and brush with beaten egg. Chill in the fridge for 30 mins, then brush again with beaten egg and chill for a further 30 mins. Leave to rise for 1 hr at room temperature. Heat oven to 200C/180C fan/gas 6, then bake for 22 mins. Serve warm.",
    "isApproved": true
  },
  {
    "title": "Kidney Bean Curry",
    "keyIngredients": [
      "Vegetable Oil",
      "Onion",
      "Garlic",
      "Ginger",
      "Coriander",
      "Cumin",
      "Paprika",
      "Garam Masala",
      "Chopped Tomatoes",
      "Kidney Beans",
      "Basmati Rice",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/sywrsu1511463066.jpg",
    "instructions": "Heat the oil in a large frying pan over a low-medium heat. Add the onion and a pinch of salt and cook slowly, stirring occasionally, until softened and just starting to colour. Add the garlic, ginger and coriander stalks and cook for a further 2 mins, until fragrant.\r\n\r\nAdd the spices to the pan and cook for another 1 min, by which point everything should smell aromatic. Tip in the chopped tomatoes and kidney beans in their water, then bring to the boil.\r\n\r\nTurn down the heat and simmer for 15 mins until the curry is nice and thick. Season to taste, then serve with the basmati rice and the coriander leaves.",
    "isApproved": true
  },
  {
    "title": "Cream Cheese Tart",
    "keyIngredients": [
      "Flour",
      "Butter",
      "Egg",
      "Salt",
      "Cheese",
      "Milk",
      "Eggs",
      "Parmesan Cheese",
      "Plum tomatoes",
      "White Vinegar",
      "Honey",
      "Basil",
      "",
      "",
      "",
      null,
      null,
      null,
      null,
      null
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wurrux1468416624.jpg",
    "instructions": "Crust: make a dough from 250g flour (I like mixing different flours like plain and wholegrain spelt flour), 125g butter, 1 egg and a pinch of salt, press it into a tart form and place it in the fridge. Filling: stir 300g cream cheese and 100ml milk until smooth, add in 3 eggs, 100g grated parmesan cheese and season with salt, pepper and nutmeg. Take the crust out of the fridge and prick the bottom with a fork. Pour in the filling and bake at 175 degrees C for about 25 minutes. Cover the tart with some aluminium foil after half the time. In the mean time, slice about 350g mini tomatoes. In a small pan heat 3tbsp olive oil, 3tbsp white vinegar, 1 tbsp honey, salt and pepper and combine well. Pour over the tomato slices and mix well. With a spoon, place the tomato slices on the tart, avoiding too much liquid on it. Decorate with basil leaves and enjoy",
    "isApproved": true
  },
  {
    "title": "Sticky Toffee Pudding Ultimate",
    "keyIngredients": [
      "Medjool dates",
      "water",
      "vanilla extract",
      "self-raising flour",
      "bicarbonate of soda",
      "eggs",
      "butter",
      "demerara sugar",
      "black treacle",
      "milk",
      "ice cream",
      "muscovado sugar",
      "butter",
      "double cream",
      "black treacle",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xrptpq1483909204.jpg",
    "instructions": "Stone and chop the dates quite small, put them in a bowl, then pour the boiling water over. Leave for about 30 mins until cool and well-soaked, then mash a bit with a fork. Stir in the vanilla extract. Butter and flour seven mini pudding tins (each about 200ml/7fl oz) and sit them on a baking sheet. Heat oven to 180C/fan 160C/gas 4.\r\nWhile the dates are soaking, make the puddings. Mix the flour and bicarbonate of soda together and beat the eggs in a separate bowl. Beat the butter and sugar together in a large bowl for a few mins until slightly creamy (the mixture will be grainy from the sugar). Add the eggs a little at a time, beating well between additions. Beat in the black treacle then, using a large metal spoon, gently fold in one-third of the flour, then half the milk, being careful not to overbeat. Repeat until all the flour and milk is used. Stir the soaked dates into the pudding batter. The mix may look a little curdled at this point and will be like a soft, thick batter. Spoon it evenly between the tins and bake for 20-25 mins, until risen and firm.\r\nMeanwhile, put the sugar and butter for the sauce in a medium saucepan with half the cream. Bring to the boil over a medium heat, stirring all the time, until the sugar has completely dissolved. Stir in the black treacle, turn up the heat slightly and let the mixture bubble away for 2-3 mins until it is a rich toffee colour, stirring occasionally to make sure it doesn’t burn. Take the pan off the heat and beat in the rest of the cream.\r\nRemove the puddings from the oven. Leave in the tins for a few mins, then loosen them well from the sides of the tins with a small palette knife before turning them out. You can serve them now with the sauce drizzled over, but they’ll be even stickier if left for a day or two coated in the sauce. To do this, pour about half the sauce into one or two ovenproof serving dishes. Sit the upturned puddings on the sauce, then pour the rest of the sauce over them. Cover with a loose tent of foil so that the sauce doesn’t smudge (no need to chill).\r\nWhen ready to serve, heat oven to 180C/fan 160C/gas 4. Warm the puddings through, still covered, for 15-20 mins or until the sauce is bubbling. Serve them on their own, or with cream or custard.",
    "isApproved": true
  },
  {
    "title": "Budino Di Ricotta",
    "keyIngredients": [
      "Ricotta",
      "Eggs",
      "Flour",
      "Sugar",
      "Cinnamon",
      "Lemons",
      "Dark Rum",
      "Icing Sugar",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/1549542877.jpg",
    "instructions": "Mash the ricotta and beat well with the egg yolks, stir in the flour, sugar, cinnamon, grated lemon rind and the rum and mix well. You can do this in a food processor. Beat the egg whites until stiff, fold in and pour into a buttered and floured 25cm cake tin. Bake in the oven at 180ºC/160ºC fan/gas 4 for about 40 minutes, or until it is firm.\r\n\r\nServe hot or cold dusted with icing sugar.",
    "isApproved": true
  },
  {
    "title": "Montreal Smoked Meat",
    "keyIngredients": [
      "Beef Brisket",
      "Salt",
      "Black Pepper",
      "Coriander",
      "Sugar",
      "Bay Leaf",
      "Cloves",
      "Black Pepper",
      "Coriander",
      "Paprika",
      "Garlic",
      "Onion",
      "Dill",
      "English Mustard",
      "Celery Salt",
      "Red Pepper Flakes",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/uttupv1511815050.jpg",
    "instructions": "To make the cure, in a small bowl mix together salt, pink salt, black pepper, coriander, sugar, bay leaf, and cloves. Coat entire brisket with the cure and place in an extra-large resealable plastic bag. Place in the coldest part of the refrigerator and cure for 4 days, flipping brisket twice a day.\r\nRemove brisket from bag and wash as much cure off as possible under cold running water. Place brisket in a large container and fill with water and let soak for 2 hours, replacing water every 30 minutes. Remove from water and pat dry with paper towels.\r\nTo make the rub, mix together black pepper, coriander, paprika, garlic powder, onion powder, dill weed, mustard, celery seed, and crushed red papper in a small bowl. Coat entire brisket with the rub.\r\nFire up smoker or grill to 225 degrees, adding chunks of smoking wood chunks when at temperature. When wood is ignited and producing smoke, place brisket in, fat side up, and smoke until an instant read thermometer registers 165 degrees when inserted into thickest part of the brisket, about 6 hours.\r\nTransfer brisket to large roasting pan with V-rack. Place roasting pan over two burners on stovetop and fill with 1-inch of water. Bring water to a boil over high heat, reduce heat to medium, cover roasting pan with aluminum foil, and steam brisket until an instant read thermometer registers 180 degrees when inserted into thickest part of the meat, 1 to 2 hours, adding more hot water as needed.\r\nTransfer brisket to cutting board and let cool slightly. Slice and serve, preferably on rye with mustard.",
    "isApproved": true
  },
  {
    "title": "New York cheesecake",
    "keyIngredients": [
      "Butter",
      "Sour Cream",
      "Sugar",
      "Cream Cheese",
      "Caster Sugar",
      "Plain Flour",
      "Lemon Juice",
      "Eggs",
      "Sour Cream",
      "Sour Cream",
      "Caster Sugar",
      "Lemon Juice",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/swttys1511385853.jpg",
    "instructions": "Position an oven shelf in the middle of the oven. Preheat the oven to fan 160C/conventional 180C/gas 4. Line the base of a 23cm springform cake tin with parchment paper. For the crust, melt the butter in a medium pan. Stir in the biscuit crumbs and sugar so the mixture is evenly moistened. Press the mixture into the bottom of the pan and bake for 10 minutes. Cool on a wire rack while preparing the filling.\r\nFor the filling, increase the oven temperature to fan 200C/conventional 240C/gas 9. In a table top mixer fitted with the paddle attachment, beat the soft cheese at medium-low speed until creamy, about 2 minutes. With the mixer on low, gradually add the sugar, then the flour and a pinch of salt, scraping down the sides of the bowl and the paddle twice.\r\nSwap the paddle attachment for the whisk. Continue by adding the vanilla, lemon zest and juice. Whisk in the eggs and yolk, one at a time, scraping the bowl and whisk at least twice. Stir the 284ml carton of soured cream until smooth, then measure 200ml/7fl oz (just over 3⁄4 of the carton). Continue on low speed as you add the measured soured cream (reserve the rest). Whisk to blend, but don't over-beat. The batter should be smooth, light and somewhat airy.\r\nBrush the sides of the springform tin with melted butter and put on a baking sheet. Pour in the filling - if there are any lumps, sink them using a knife - the top should be as smooth as possible. Bake for 10 minutes. Reduce oven temperature to fan 90C/conventional 110C/gas 1⁄4 and bake for 25 minutes more. If you gently shake the tin, the filling should have a slight wobble. Turn off the oven and open the oven door for a cheesecake that's creamy in the centre, or leave it closed if you prefer a drier texture. Let cool in the oven for 2 hours. The cheesecake may get a slight crack on top as it cools.\r\nCombine the reserved soured cream with the 142ml carton, the sugar and lemon juice for the topping. Spread over the cheesecake right to the edges. Cover loosely with foil and refrigerate for at least 8 hours or overnight.\r\nRun a round-bladed knife around the sides of the tin to loosen any stuck edges. Unlock the side, slide the cheesecake off the bottom of the tin onto a plate, then slide the parchment paper out from underneath.",
    "isApproved": true
  },
  {
    "title": "Chocolate Caramel Crispy",
    "keyIngredients": [
      "Mars Bar",
      "Butter",
      "Rice Krispies",
      "Milk Chocolate",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/1550442508.jpg",
    "instructions": "Grease and line a 20 x 20cm/8\" x 8\" baking tin with parchment paper.\r\nPut the mars bars and butter in a heat proof bowl and place over a pan of barely simmering water. Mixing with a whisk, melt until the mixture is smooth.\r\nPour over the rice krispies in a mixing bowl and mix until all the ingredients are evenly combined. Press evenly into the prepare baking tin and set aside.\r\nMelt the milk chocolate in the microwave or over a pan of barely simmering water.\r\nSpread the melted chocolate over the rice krispie mixture and leave to set in a cool place. Once set slice into squares and serve!",
    "isApproved": true
  },
  {
    "title": "Smoky Lentil Chili with Squash",
    "keyIngredients": [
      "Olive Oil",
      "Onion",
      "Leek",
      "Garlic",
      "Cumin",
      "Coriander",
      "Smoked Paprika",
      "Cinnamon",
      "Chili Powder",
      "Cocoa",
      "Dried Oregano",
      "Diced Tomatoes",
      "Water",
      "Carrots",
      "Brown Lentils",
      "Sea Salt",
      "Squash",
      "Cashews",
      "Apple Cider Vinegar",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/uwxqwy1483389553.jpg",
    "instructions": "Begin by roasting the squash. Slice it into thin crescents and drizzle with a little oil and sprinkle with sea salt. I added a fresh little sage I had in the fridge, but it’s unnecessary. Roast the squash a 205 C (400 F) for 20-30 minutes, flipping halfway through, until soft and golden. Let cool and chop into cubes.\r\nMeanwhile, rinse the lentils and cover them with water. Bring them to the boil then turn down to a simmer and let cook (uncovered) for 20-30 minutes, or until tender. Drain and set aside.\r\nWhile the lentils are cooking heat the 1 Tbsp. of oil on low in a medium pot. Add the onions and leeks and sauté for 5 or so minutes, or until they begin to soften. Add the garlic next along with the cumin and coriander, cooking for a few more minutes. Add the remaining spices – paprika, cinnamon, chilli, cocoa, Worcestershire sauce, salt, and oregano. Next add the can of tomatoes, the water or stock, and carrots. Let simmer, covered, for 20 minutes or until the veg is tender and the mixture has thickened up. You’ll need to check on the pot periodically for a stir and a top of of liquid if needed.\r\nAdd the lentils and chopped roasted squash. Let cook for 10 more minutes to heat through.\r\nServe with sliced jalapeno, lime wedges, cilantro, green onions, and cashew sour cream.\r\n\r\nSIMPLE CASHEW SOUR CREAM\r\n\r\n1 Cup Raw Unsalted Cashews\r\nPinch Sea Salt\r\n1 tsp. Apple Cider Vinegar\r\nWater\r\n\r\nBring some water to the boil, and use it to soak the cashews for at least four hours. Alternatively, you can use cold water and let the cashews soak overnight, but I’m forgetful/lazy, so often use the boil method which is much faster.\r\nAfter the cashews have soaked, drain them and add to a high speed blender. Begin to puree, slowly adding about 1/2 cup fresh water, until a creamy consistency is reached. You may need to add less or more water to reach the desired consistency.\r\nAdd a pinch of sea salt and vinegar (or lemon juice).",
    "isApproved": true
  },
  {
    "title": "Potato Gratin with Chicken",
    "keyIngredients": [
      "Potatoes",
      "Onions",
      "Olive Oil",
      "Chicken Stock",
      "Creme Fraiche",
      "Parmesan",
      "Chicken Breasts",
      "Bacon",
      "Spinach",
      "Peas",
      "",
      "",
      "",
      "",
      "",
      null,
      null,
      null,
      null,
      null
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/qwrtut1468418027.jpg",
    "instructions": "15 minute potato gratin with chicken and bacon greens: a gratin always seems more effort and more indulgent than ordinary boiled or roasts, but it doesn't have to take 45mins, it's nice for a change and you can control the calorie content by going with full fat to low fat creme fraiche. (It's always tastes better full fat though obviously!) to serve 4: use 800g of potatoes, finely slice and boil in a pan for about 5-8 mins till firmish, not soft. Finely slice 3 onions and place in an oven dish with 2 tblsp of olive oil and 100ml of chicken stock. Cook till the onions are soft then drain the potatoes and pour onto the onions. Season and spoon over cream or creme fraiche till all is covered but not swimming. Grate Parmesan over the top then finish under the grill till nicely golden. serve with chicken and bacon, peas and spinach.",
    "isApproved": true
  },
  {
    "title": "Spicy Arrabiata Penne",
    "keyIngredients": [
      "penne rigate",
      "olive oil",
      "garlic",
      "chopped tomatoes",
      "red chile flakes",
      "italian seasoning",
      "basil",
      "Parmigiano-Reggiano",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      null,
      null,
      null,
      null,
      null
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/ustsqw1468250014.jpg",
    "instructions": "Bring a large pot of water to a boil. Add kosher salt to the boiling water, then add the pasta. Cook according to the package instructions, about 9 minutes.\r\nIn a large skillet over medium-high heat, add the olive oil and heat until the oil starts to shimmer. Add the garlic and cook, stirring, until fragrant, 1 to 2 minutes. Add the chopped tomatoes, red chile flakes, Italian seasoning and salt and pepper to taste. Bring to a boil and cook for 5 minutes. Remove from the heat and add the chopped basil.\r\nDrain the pasta and add it to the sauce. Garnish with Parmigiano-Reggiano flakes and more basil and serve warm.",
    "isApproved": true
  },
  {
    "title": "Christmas Pudding Flapjack",
    "keyIngredients": [
      "salted butter",
      "dark soft brown sugar",
      "golden syrup",
      "orange",
      "rolled oats",
      "Christmas pudding",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/vvusxs1483907034.jpg",
    "instructions": "Preheat the oven to 180°C/fan 160°C/gas mark 4 and grease and line a 25cm x 20cm tin. Melt the butter, sugar, syrup and orange zest in a large saucepan over a medium heat. The aim is to dissolve all the ingredients so that they are smooth, but to not lose any volume through boiling so be careful not to overheat.\r\n\r\nAdd the oats and stir well until evenly coated. Stir through the leftover Christmas pudding and tip into the prepared tin. Use a spoon to flatten the top and bake for 40 minutes until the edges start to brown. Whilst still warm in the tin, score into 12 squares. Allow to cool completely before cutting along the scores.\r\n\r\nKeeps for 5 days in an air tight tin or freeze for up to 1 month.",
    "isApproved": true
  },
  {
    "title": "Osso Buco alla Milanese",
    "keyIngredients": [
      "Veal",
      "Flour",
      "Olive Oil",
      "Butter",
      "Onion",
      "Carrot",
      "Celery",
      "Fennel",
      "Garlic",
      "Orange Zest",
      "Marjoram",
      "Bay Leaf",
      "Dry White Wine",
      "Chicken Stock",
      "Tomatoes",
      "Parsley",
      "Garlic",
      "Lemon Zest",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wwuqvt1487345467.jpg",
    "instructions": "Heat the oven to 300 degrees.\r\nDredging the shanks: pour the flour into a shallow dish (a pie plate works nicely). Season the veal shanks on all sides with salt and pepper. One at a time, roll the shanks around in the flour coat, and shake and pat the shank to remove any excuses flour. Discard the remaining flour.\r\nBrowning the shanks: put the oil and 1 tablespoon of the butter in a wide Dutch oven or heavy braising pot (6 to 7 quart) and heat over medium-high heat. When the butter has melted and the oil is shimmering, lower the shanks into the pot, flat side down; if the shanks won’t fit without touching one another, do this in batches. Brown the shanks, turning once with tongs, until both flat sides are well caramelized, about 5 minutes per side. If the butter-oil mixture starts to burn, lower the heat just a bit. Transfer the shanks to a large platter or tray and set aside.\r\nThe aromatics: pour off and discard the fat from the pot. Wipe out any burnt bits with a damp paper towel, being careful not to remove any delicious little caramelized bits. Ad the remaining 2 tablespoons butter to the pot and melt it over medium heat. When the butter has stopped foaming, add the onion, carrot, celery, and fennel. Season with salt and pepper, stir, and cook the vegetables until they begin to soften but do not brown, about 6 minutes. Stir in the garlic, orange zest, marjoram, and bay leaf, and stew for another minute or two.\r\nThe braising liquid: add the wine, increase the heat to high, and bring to a boil. Boil, stirring occasionally, to reduce the wine by about half, 5 minutes. Add the stock and tomatoes, with their juice, and boil again to reduce the liquid to about 1 cup total, about 10 minutes.\r\nThe braise: Place the shanks in the pot so that they are sitting with the exposed bone facing up, and pour over any juices that accumulated as they sat. Cover with parchment paper, pressing down so the parchment nearly touches the veal and the edges hang over the sides of the pot by about an inch. Cover tightly with the lid, and slide into the lower part of the oven to braise at a gentle simmer. Check the pot after the first 15 minutes, and if the liquid is simmering too aggressively, lower the oven heat by 10 or 15 degrees. Continue braising, turning the shanks and spooning some pan juices over the top after the first 40 minutes, until the meat is completely tender and pulling away from the bone, about 2 hours.\r\nThe gremolata: While the shanks are braising, stir together the garlic, parsley, and lemon zest in a small bowl. Cover with plastic wrap and set aside in a cool place (or the refrigerator, if your kitchen is very warm.)\r\nThe finish: When the veal is fork-tender and falling away from the bone, remove the lid and sprinkle over half of the gremolata. Return the veal to the oven, uncovered, for another 15 minutes to caramelize it some.\r\nUsing a slotted spatula or spoon, carefully lift the shanks from the braising liquid, doing your best to keep them intact. The shanks will be very tender and threatening to fall into pieces, and the marrow will be wobbly inside the bones, so this can be a bit tricky. But if they do break apart, don’t worry, the flavor won’t suffer at all. Arrange the shanks on a serving platter or other large plate, without stacking, and cover with foil to keep warm.\r\nFinishing the sauce: Set the braising pot on top of the stove and evaluate the sauce: if there is a visible layer of fat floating on the surface, use a large spoon to skim it off and discard it. Taste the sauce for concentration of flavor. If it tastes a bit weak or flat, bring it to a boil over high heat, and boil to reduce the volume and intensify the flavor for 5 to 10 minutes. Taste again for salt and pepper. If the sauce wants more zip, stir in a teaspoon or two of the remaining gremolata.\r\nPortioning the veal shanks: if the shanks are reasonably sized, serve one per person. If the shanks are gargantuan or you’re dealing with modest appetites, pull apart the larger shanks, separating them at their natural seams, and serve smaller amounts. Be sure to give the marrow bones to whomever prizes them most.\r\nServing: Arrange the veal shanks on warm dinner plates accompanied by the risotto, if serving. Just before carrying the plates to the table, sprinkle on the remaining gremolata and then spoon over a generous amount of sauce – the contact with the hot liquid will aromatize the gremolata and perk up everyone’s appetite with the whiff of garlic and lemon.",
    "isApproved": true
  },
  {
    "title": "Chicken Karaage",
    "keyIngredients": [
      "Chicken thigh",
      "Ginger",
      "Garlic",
      "Soy sauce",
      "Sake",
      "Granulated sugar",
      "Potato starch",
      "Vegetable oil",
      "Lemon",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/tyywsw1505930373.jpg",
    "instructions": "Add the ginger, garlic, soy sauce, sake and sugar to a bowl and whisk to combine. Add the chicken, then stir to coat evenly. Cover and refrigerate for at least 1 hour.\r\n\r\nAdd 1 inch of vegetable oil to a heavy bottomed pot and heat until the oil reaches 360 degrees F. Line a wire rack with 2 sheets of paper towels and get your tongs out. Put the potato starch in a bowl\r\n\r\nAdd a handful of chicken to the potato starch and toss to coat each piece evenly.\r\n\r\nFry the karaage in batches until the exterior is a medium brown and the chicken is cooked through. Transfer the fried chicken to the paper towel lined rack. If you want the karaage to stay crispy longer, you can fry the chicken a second time, until it's a darker color after it's cooled off once. Serve with lemon wedges.",
    "isApproved": true
  },
  {
    "title": "Jam Roly-Poly",
    "keyIngredients": [
      "Butter",
      "Self-raising Flour",
      "Vanilla",
      "Suet",
      "Milk",
      "Raspberry Jam",
      "Custard",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/ysqupp1511640538.jpg",
    "instructions": "Put a deep roasting tin onto the bottom shelf of the oven, and make sure that there’s another shelf directly above it. Pull the roasting tin out on its shelf, fill two-thirds with boiling water from the kettle, then carefully slide it back in. Heat oven to 180C/160C fan/gas 4. Tear off a large sheet of foil and greaseproof paper (about 30 x 40cm). Sit the greaseproof on top of the foil and butter it.\r\nTip butter, flour and vanilla seeds into a food processor; pulse until the butter has disappeared. Tip into a mixing bowl. Stir through the suet, pour in the milk and work together with a cutlery knife until you get a sticky dough. You may need a drop more milk, depending on your flour.\r\nTip the dough out onto a floured surface, quickly pat together to smooth, then roll out to a square roughly 25 x 25cm. Spread the jam all over, leaving a gap along one edge, then roll up from the opposite edge. Pinch the jam-free edge into the dough where it meets, and pinch the ends roughly, too. Carefully lift onto the greased paper, join-side down (you might find a flat baking sheet helpful for this), loosely bring up the paper and foil around it, then scrunch together along the edges and ends to seal. The roly-poly will puff quite a bit during cooking so don’t wrap it tightly. Lift the parcel directly onto the rack above the tin and cook for 1 hr.\r\nLet the pudding sit for 5 mins before unwrapping, then carefully open the foil and paper, and thickly slice to serve.",
    "isApproved": true
  },
  {
    "title": "Chicken & mushroom Hotpot",
    "keyIngredients": [
      "Butter",
      "Onion",
      "Mushrooms",
      "Plain Flour",
      "Chicken Stock Cube",
      "Nutmeg",
      "Mustard Powder",
      "Chicken",
      "Sweetcorn",
      "Potatoes",
      "Butter",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/uuuspp1511297945.jpg",
    "instructions": "Heat oven to 200C/180C fan/gas 6. Put the butter in a medium-size saucepan and place over a medium heat. Add the onion and leave to cook for 5 mins, stirring occasionally. Add the mushrooms to the saucepan with the onions.\r\n\r\nOnce the onion and mushrooms are almost cooked, stir in the flour – this will make a thick paste called a roux. If you are using a stock cube, crumble the cube into the roux now and stir well. Put the roux over a low heat and stir continuously for 2 mins – this will cook the flour and stop the sauce from having a floury taste.\r\n\r\nTake the roux off the heat. Slowly add the fresh stock, if using, or pour in 500ml water if you’ve used a stock cube, stirring all the time. Once all the liquid has been added, season with pepper, a pinch of nutmeg and mustard powder. Put the saucepan back onto a medium heat and slowly bring it to the boil, stirring all the time. Once the sauce has thickened, place on a very low heat. Add the cooked chicken and vegetables to the sauce and stir well. Grease a medium-size ovenproof pie dish with a little butter and pour in the chicken and mushroom filling.\r\n\r\nCarefully lay the potatoes on top of the hot-pot filling, overlapping them slightly, almost like a pie top.\r\n\r\nBrush the potatoes with a little melted butter and cook in the oven for about 35 mins. The hot-pot is ready once the potatoes are cooked and golden brown.",
    "isApproved": true
  },
  {
    "title": "Steak Diane",
    "keyIngredients": [
      "Canola Oil",
      "Beef Fillet",
      "Beef Stock",
      "Butter",
      "Garlic",
      "Challots",
      "Mushrooms",
      "Brandy",
      "Heavy Cream",
      "Dijon Mustard",
      "Worcestershire Sauce",
      "Tabasco Sauce",
      "Parsley",
      "Chives",
      "Salt",
      "Pepper",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/vussxq1511882648.jpg",
    "instructions": "Heat oil in a 12\" skillet over medium-high heat. Season steaks with salt and pepper, and add to skillet; cook, turning once, until browned on both sides and cooked to desired doneness, about 4 to 5 minutes for medium-rare. Transfer steaks to a plate, and set aside.\r\nReturn skillet to high heat, and add stock; cook until reduced until to 1⁄2 cup, about 10 minutes. Pour into a bowl, and set aside. Return skillet to heat, and add butter; add garlic and shallots, and cook, stirring, until soft, about 2 minutes. Add mushrooms, and cook, stirring, until they release any liquid and it evaporates and mushrooms begin to brown, about 2 minutes. Add cognac, and light with a match to flambée; cook until flame dies down. Stir in reserved stock, cream, Dijon, Worcestershire, and hot sauce, and then return steaks to skillet; cook, turning in sauce, until warmed through and sauce is thickened, about 4 minutes. Transfer steak to serving plates and stir parsley and chives into sauce; pour sauce over steaks to serve.",
    "isApproved": true
  },
  {
    "title": "Ribollita",
    "keyIngredients": [
      "Olive Oil",
      "Onion",
      "Carrot",
      "Celery",
      "Garlic",
      "Cannellini Beans",
      "Canned tomatoes",
      "Water",
      "Rosemary",
      "Thyme",
      "Kale",
      "Wholegrain Bread",
      "Red Onion",
      "Parmesan",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xrrwpx1487347049.jpg",
    "instructions": "Put 2 tablespoons of the oil in a large pot over medium heat. When it’s hot, add onion, carrot, celery and garlic; sprinkle with salt and pepper and cook, stirring occasionally, until vegetables are soft, 5 to 10 minutes.\r\nHeat the oven to 500 degrees. Drain the beans; if they’re canned, rinse them as well. Add them to the pot along with tomatoes and their juices and stock, rosemary and thyme. Bring to a boil, then reduce heat so the soup bubbles steadily; cover and cook, stirring once or twice to break up the tomatoes, until the flavors meld, 15 to 20 minutes.\r\nFish out and discard rosemary and thyme stems, if you like, and stir in kale. Taste and adjust seasoning. Lay bread slices on top of the stew so they cover the top and overlap as little as possible. Scatter red onion slices over the top, drizzle with the remaining 3 tablespoons oil and sprinkle with Parmesan.\r\nPut the pot in the oven and bake until the bread, onions and cheese are browned and crisp, 10 to 15 minutes. (If your pot fits under the broiler, you can also brown the top there.) Divide the soup and bread among 4 bowls and serve.",
    "isApproved": true
  },
  {
    "title": "Grilled Mac and Cheese Sandwich",
    "keyIngredients": [
      "Macaroni",
      "Plain Flour",
      "Mustard Powder",
      "Garlic powder",
      "Kosher salt",
      "Black pepper",
      "Cayenne pepper",
      "Butter",
      "Whole Milk",
      "Heavy Cream",
      "Monterey Jack Cheese",
      "Butter",
      "garlic powder",
      "Bread",
      "Cheddar Cheese",
      "Colby Jack Cheese",
      "Butter",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xutquv1505330523.jpg",
    "instructions": "Make the mac and cheese\r\n\r\n1. Bring a medium saucepan of generously salted water (you want it to taste like seawater) to a boil. Add the pasta and cook, stirring occasionally, until al dente, 8 to 10 minutes, or according to the package directions. The pasta should be tender but still chewy.\r\n2. While the pasta is cooking, in a small bowl, whisk together the flour, mustard powder, garlic powder, salt, black pepper, and cayenne pepper.\r\n3. Drain the pasta in a colander. Place the empty pasta pan (no need to wash it) over low heat and add the butter. When the butter has melted, whisk in the flour mixture and continue to cook, whisking frequently, until the mixture is beginning to brown and has a pleasant, nutty aroma, about 1 minute. Watch carefully so it does not scorch on the bottom of the pan.\r\n4. Slowly whisk the milk and cream into the flour mixture until everything is really well combined. Cook, whisking constantly, until the sauce is heated through and just begins to thicken, about 2 minutes. Remove from the heat. Gradually add the cheese while stirring constantly with a wooden spoon or silicone spatula and keep stirring until the cheese has melted into the sauce. Then stir in the drained cooked pasta.\r\n5. Line a 9-by-13-inch (23-by-33-centimeter) rimmed baking sheet with parchment paper or aluminum foil. Coat the paper or foil with nonstick cooking spray or slick it with butter. Pour the warm mac and cheese onto the prepared baking sheet and spread it evenly with a spatula. Coat another piece of parchment paper with cooking spray or butter and place it, oiled or buttered side down, directly on the surface of the mac and cheese. Refrigerate until cool and firm, about 1 hour.\r\n\r\nMake the grilled cheese\r\n6. Heat a large cast-iron or nonstick skillet over medium-low heat.\r\n7. In a small bowl, stir together the 4 tablespoons (55 grams) butter and garlic powder until well blended.\r\n8. Remove the mac and cheese from the refrigerator and peel off the top layer of parchment paper. Carefully cut into 8 equal pieces. Each piece will make 1 grilled mac and cheese sandwich. (You can stash each individual portion in a double layer of resealable plastic bags and refrigerate for up to 3 days or freeze it for up to 1 month.)\r\n9. Spread 3/4 teaspoon garlic butter on one side of each bread slice. Place half of the slices, buttered-side down, on a clean cutting board. Top each with one slice of Cheddar, then 1 piece of the mac and cheese. (Transfer from the baking sheet by scooting your hand or a spatula under each piece of mac and cheese and then flipping it over onto a sandwich.) Place 1 slice of Jack on top of each. Finish with the remaining bread slices, buttered-side up.\r\n10. Using a wide spatula, place as many sandwiches in the pan as will fit without crowding it. Cover and cook until the bottoms are nicely browned, about 4 minutes. Turn and cook until the second sides are browned, the cheese is melted, and the mac and cheese is heated through, about 4 minutes more.\r\n11. Repeat with the remaining ingredients. Cut the sandwiches in half, if desired, and serve.",
    "isApproved": true
  },
  {
    "title": "McSinghs Scotch pie",
    "keyIngredients": [
      "Cumin",
      "Rapeseed Oil",
      "Red Onions",
      "Garlic Clove",
      "Green Chilli",
      "Red Pepper",
      "Nutmeg",
      "Coriander",
      "Lamb Mince",
      "Pepper",
      "Coriander",
      "Plain Flour",
      "Salt",
      "Milk",
      "Lard",
      "Egg Yolks",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/vssrtx1511557680.jpg",
    "instructions": "Heat a large frying pan and toast the cumin seeds for a few minutes, then set aside. Heat the oil in the same pan and fry the onion, garlic, chilli, pepper and a good pinch of salt for around eight minutes, until there is no moisture left. Remove from the heat, stir in the toasted cumin seeds, ground mace (or nutmeg) and ground coriander. Leave to cool.\r\nIn a large bowl mix together the minced lamb, white pepper, fresh coriander, and the cooled spiced onion mixture until combined. Set aside, covered, in the fridge.\r\nPreheat the oven to 200C/400F/Gas 6 and generously grease a 20cm/8in diameter loose-bottomed or springform round cake tin with lard.\r\nTo make the pastry, sift the flour and salt in a large bowl and make a well in the centre.\r\nPut the milk, lard and 90ml/3fl oz of water in a saucepan and heat gently. When the lard has melted, increase the heat and bring to the boil.\r\nPour the boiling liquid into the flour, and use a wooden spoon to combine until cool enough to handle. Bring together into a ball.\r\nDust a work surface with flour and, working quickly, knead the dough briefly – it will be soft and moist. Set aside a third of the pastry and roll the rest out on a well-floured surface. Line the pie dish with the pastry, pressing it right up the sides until it pokes just over the top of the tin.\r\nAdd the filling into the pastry-lined tin bit by bit. As you reach the top, form a slight peak. Roll out the reserved pastry and top the pie with it. Pinch the edges to seal and trim the excess. Poke a hole in the top of the pie and insert a small tube made from aluminium foil to allow steam to escape.\r\nBrush the top of the pie with a little beaten egg yolk, and bake in the preheated oven for 30 minutes (put a tray on the shelf below to catch any drips). Then reduce the temperature to 160C/325F/Gas 3 and cook for a further 1¼ hours until golden-brown. Leave to cool completely before refrigerating for two hours, or overnight.\r\nRun a knife around the edge of the pie, remove from the tin and serve with chutneys, salads or pickles.",
    "isApproved": true
  },
  {
    "title": "Kapsalon",
    "keyIngredients": [
      "Fries",
      "Doner Meat",
      "Garlic sauce",
      "Hotsauce",
      "Lettuce",
      "Tomato",
      "Cucumber",
      "Gouda cheese",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      null,
      null,
      null,
      null,
      null
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/sxysrt1468240488.jpg",
    "instructions": "Cut the meat into strips. Heat oil in a pan and fry the strips for 6 minutes until it's ready.\r\nBake the fries until golden brown in a deep fryrer. When ready transfer to a backing dish. Make sure the fries are spread over the whole dish.\r\nCover the fries with a new layer of meat and spread evenly.\r\nAdd a layer of cheese over the meat. You can also use grated cheese. When done put in the oven for a few minutes until the cheese is melted.\r\nChop the lettuce, tomato and cucumber in small pieces and mix together. for a basic salad. As extra you can add olives jalapenos and a red union.\r\nDived the salad over the dish and Serve with garlicsauce and hot sauce",
    "isApproved": true
  },
  {
    "title": "Jerk chicken with rice & peas",
    "keyIngredients": [
      "Chicken Thighs",
      "Lime",
      "Spring Onions",
      "Ginger",
      "Garlic",
      "Onion",
      "Red Chilli",
      "Thyme",
      "Lime",
      "Soy Sauce",
      "Vegetable Oil",
      "Brown Sugar",
      "Allspice",
      "Basmati Rice",
      "Coconut Milk",
      "Spring Onions",
      "Thyme",
      "Garlic",
      "Allspice",
      "Kidney Beans"
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/tytyxu1515363282.jpg",
    "instructions": "To make the jerk marinade, combine all the ingredients in a food processor along with 1 tsp salt, and blend to a purée. If you’re having trouble getting it to blend, just keep turning off the blender, stirring the mixture, and trying again. Eventually it will start to blend up – don’t be tempted to add water, as you want a thick paste.\r\n\r\nTaste the jerk mixture for seasoning – it should taste pretty salty, but not unpleasantly, puckering salty. You can now throw in more chillies if it’s not spicy enough for you. If it tastes too salty and sour, try adding in a bit more brown sugar until the mixture tastes well balanced.\r\n\r\nMake a few slashes in the chicken thighs and pour the marinade over the meat, rubbing it into all the crevices. Cover and leave to marinate overnight in the fridge.\r\n\r\nIf you want to barbecue your chicken, get the coals burning 1 hr or so before you’re ready to cook. Authentic jerked meats are not exactly grilled as we think of grilling, but sort of smoke-grilled. To get a more authentic jerk experience, add some wood chips to your barbecue, and cook your chicken over slow, indirect heat for 30 mins. To cook in the oven, heat to 180C/160C fan/gas 4. Put the chicken pieces in a roasting tin with the lime halves and cook for 45 mins until tender and cooked through.\r\n\r\nWhile the chicken is cooking, prepare the rice & peas. Rinse the rice in plenty of cold water, then tip it into a large saucepan with all the remaining ingredients except the kidney beans. Season with salt, add 300ml cold water and set over a high heat. Once the rice begins to boil, turn it down to a medium heat, cover and cook for 10 mins.\r\n\r\nAdd the beans to the rice, then cover with a lid. Leave off the heat for 5 mins until all the liquid is absorbed. Squeeze the roasted lime over the chicken and serve with the rice & peas, and some hot sauce if you like it really spicy.",
    "isApproved": true
  },
  {
    "title": "Flamiche",
    "keyIngredients": [
      "Butter",
      "Leek",
      "Salt",
      "Creme Fraiche",
      "Egg",
      "Egg Yolks",
      "Nutmeg",
      "Plain Flour",
      "Salt",
      "Butter",
      "Lard",
      "Cheddar Cheese",
      "Water",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wssvvs1511785879.jpg",
    "instructions": "For the pastry, sift the flour and salt into the bowl of a food processor, add the butter and lard, then whizz together briefly until the mixture looks like fine breadcrumbs. Tip the mixture into a bowl, then stir in the cheese and enough of the water for the mixture to come together. Tip out onto a lightly floured surface and knead briefly until smooth. Roll out thinly and line a 23cm x 4cm loose-?bottomed fluted flan tin. Prick the base with a fork. Chill for 20 minutes.\r\n02.Melt the 75g butter in a saucepan over a low heat, then add the leeks and the salt. Cover and cook for ?10 minutes until soft. Uncover the pan, increase the heat and cook ?for 2 minutes, stirring occasionally, until the liquid has evaporated. Spoon onto a plate and leave to cool.\r\n03.Preheat the oven to 200°C/fan180°C/gas 6. Line the pastry case with baking paper and baking beans or rice and blind bake for 15-20 minutes until the edges are biscuit-coloured. Remove the paper and beans/rice and return the case to the oven for 7-10 minutes until the base is crisp and lightly golden. Remove and set aside. Reduce the oven temperature to 190°C/fan170°C/gas 5.\r\n04.Put the crème fraîche into a bowl with the whole egg, egg yolks and nutmeg. Lightly beat together, then season. Stir in the leeks. Spoon ?the mixture into the tart case and bake for 35-40 minutes until set ?and lightly golden. Remove from ?the oven and leave for 10 minutes. Take out of the tin and serve.",
    "isApproved": true
  },
  {
    "title": "Katsu Chicken curry",
    "keyIngredients": [
      "chicken breast",
      "plain flour",
      "egg",
      "breadcrumbs",
      "vegetable oil",
      "sunflower oil",
      "onions",
      "garlic",
      "carrot",
      "plain flour",
      "curry powder",
      "chicken stock",
      "honey",
      "soy sauce",
      "bay leaf",
      "garam masala",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/vwrpps1503068729.jpg",
    "instructions": "Prep:15min  ›  Cook:30min  ›  Ready in:45min \r\n\r\nFor the curry sauce: Heat oil in medium non-stick saucepan, add onion and garlic and cook until softened. Stir in carrots and cook over low heat for 10 to 12 minutes.\r\nAdd flour and curry powder; cook for 1 minute. Gradually stir in stock until combined; add honey, soy sauce and bay leaf. Slowly bring to the boil.\r\nTurn down heat and simmer for 20 minutes or until sauce thickens but is still of pouring consistency. Stir in garam masala. Pour the curry sauce through a sieve; return to saucepan and keep on low heat until ready to serve.\r\nFor the chicken: Season both sides of chicken breasts with salt and pepper. Place flour, egg and breadcrumbs in separate bowls and arrange in a row. Coat the chicken breasts in flour, then dip them into the egg, then coat in breadcrumbs, making sure you cover both sides.\r\nHeat oil in large frying pan over medium-high heat. Place chicken into hot oil and cook until golden brown, about 3 or 4 minutes each side. Once cooked, place on kitchen paper to absorb excess oil.\r\nPour curry sauce over chicken, serve with white rice and enjoy!",
    "isApproved": true
  },
  {
    "title": "Dal fry",
    "keyIngredients": [
      "Toor dal",
      "Water",
      "Salt",
      "Turmeric",
      "Ghee",
      "Chopped tomatoes",
      "Cumin seeds",
      "Mustard Seeds",
      "Bay Leaf",
      "Green Chili",
      "Ginger",
      "Cilantro",
      "Red Pepper",
      "Salt",
      "Sugar",
      "Garam Masala",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wuxrtu1483564410.jpg",
    "instructions": "Wash and soak toor dal in approx. 3 cups of water, for at least one hours. Dal will be double in volume after soaking. Drain the water.\r\nCook dal with 2-1/2 cups water and add salt, turmeric, on medium high heat, until soft in texture (approximately 30 mins) it should be like thick soup.\r\nIn a frying pan, heat the ghee. Add cumin seeds, and mustard seeds. After the seeds crack, add bay leaves, green chili, ginger and chili powder. Stir for a few seconds.\r\nAdd tomatoes, salt and sugar stir and cook until tomatoes are tender and mushy.\r\nAdd cilantro and garam masala cook for about one minute.\r\nPour the seasoning over dal mix it well and cook for another minute.\r\nServe with Naan.",
    "isApproved": true
  },
  {
    "title": "BeaverTails",
    "keyIngredients": [
      "Water",
      "Yeast",
      "Sugar",
      "Milk",
      "Butter",
      "Eggs",
      "Salt",
      "Flour",
      "Oil",
      "Lemon",
      "Sugar",
      "Cinnamon",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/ryppsv1511815505.jpg",
    "instructions": "In the bowl of a stand mixer, add warm water, a big pinch of sugar and yeast. Allow to sit until frothy.\r\nInto the same bowl, add 1/2 cup sugar, warm milk, melted butter, eggs and salt, and whisk until combined.\r\nPlace a dough hook on the mixer, add the flour with the machine on, until a smooth but slightly sticky dough forms.\r\nPlace dough in a bowl, cover with plastic wrap, and allow to proof for 1 1/2 hours.\r\nCut dough into 12 pieces, and roll out into long oval-like shapes about 1/4 inch thick that resemble a beaver’s tail.\r\nIn a large, deep pot, heat oil to 350 degrees. Gently place beavertail dough into hot oil and cook for 30 to 45 seconds on each side until golden brown.\r\nDrain on paper towels, and garnish as desired. Toss in cinnamon sugar, in white sugar with a squeeze of lemon, or with a generous slathering of Nutella and a handful of toasted almonds. Enjoy!",
    "isApproved": true
  },
  {
    "title": "Beef and Oyster pie",
    "keyIngredients": [
      "Beef",
      "Olive Oil",
      "Shallots",
      "Garlic",
      "Bacon",
      "Thyme",
      "Bay Leaf",
      "Stout",
      "Beef Stock",
      "Corn Flour",
      "Oysters",
      "Plain Flour",
      "Salt",
      "Butter",
      "Eggs",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wrssvt1511556563.jpg",
    "instructions": "Season the beef cubes with salt and black pepper. Heat a tablespoon of oil in the frying pan and fry the meat over a high heat. Do this in three batches so that you don’t overcrowd the pan, transferring the meat to a large flameproof casserole dish once it is browned all over. Add extra oil if the pan seems dry.\r\nIn the same pan, add another tablespoon of oil and cook the shallots for 4-5 minutes, then add the garlic and fry for 30 seconds. Add the bacon and fry until slightly browned. Transfer the onion and bacon mixture to the casserole dish and add the herbs.\r\nPreheat the oven to 180C/350F/Gas 4.\r\nPour the stout into the frying pan and bring to the boil, stirring to lift any stuck-on browned bits from the bottom of the pan. Pour the stout over the beef in the casserole dish and add the stock. Cover the casserole and place it in the oven for 1½-2 hours, or until the beef is tender and the sauce is reduced.\r\nSkim off any surface fat, taste and add salt and pepper if necessary, then stir in the cornflour paste. Put the casserole dish on the hob – don’t forget that it will be hot – and simmer for 1-2 minutes, stirring, until thickened. Leave to cool.\r\nIncrease the oven to 200C/400F/Gas 6. To make the pastry, put the flour and salt in a very large bowl. Grate the butter and stir it into the flour in three batches. Gradually add 325ml/11fl oz cold water – you may not need it all – and stir with a round-bladed knife until the mixture just comes together. Knead the pastry lightly into a ball on a lightly floured surface and set aside 250g/9oz for the pie lid.\r\nRoll the rest of the pastry out until about 2cm/¾in larger than the dish you’re using. Line the dish with the pastry then pile in the filling, tucking the oysters in as well. Brush the edge of the pastry with beaten egg.\r\nRoll the remaining pastry until slightly larger than your dish and gently lift over the filling, pressing the edges firmly to seal, then trim with a sharp knife. Brush with beaten egg to glaze. Put the dish on a baking tray and bake for 25-30 minutes, or until the pastry is golden-brown and the filling is bubbling.",
    "isApproved": true
  },
  {
    "title": "Seafood fideuà",
    "keyIngredients": [
      "Mussels",
      "Prawns",
      "Saffron",
      "Vermicelli",
      "Olive Oil",
      "Onions",
      "Garlic",
      "Paprika",
      "Monkfish",
      "Baby Squid",
      "Fish Stock",
      "Tomatoes",
      "Lemon",
      "Parsley",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wqqvyq1511179730.jpg",
    "instructions": "Boil the kettle. Empty the mussels into a colander and run under cold water. Throw away any with broken shells. Pick through the shells, tapping each one on the side of the sink – they should be closed or should slowly close when tapped – if they stay open, throw them away. If any of the shells still have barnacles or stringy beards attached, pull them off with a cutlery knife and rinse the shells well. Keep in the colander, covered with a cold, damp cloth, until you’re ready to cook. Peel the prawn shells on the body section only – leave the heads and tails intact. Score down the backs and pull out any gritty entrails. Chill until you’re ready to cook.\r\nPut the saffron in a small cup, cover with 50ml kettle-hot water and set aside for 10 mins. If using vermicelli, put in a bowl and crush to little pieces (about 1cm long) with your hands.\r\nHeat the oil in a large frying pan with at least a 3cm lip, or a 40cm paella pan. Add the onion and stir around the pan for 5 mins until soft. Add the garlic and cook for 1 min more, then tip in the vermicelli and cook for 5 mins, stirring from time to time, until the vermicelli is toasted brown. Stir in the paprika.\r\nKeeping the heat moderate, stir through the monkfish, squid and saffron with its water, seasoning well. Spread the ingredients out in an even layer, then pour over the hot stock and scatter the tomatoes on top. Bring to a simmer, then cover the whole dish with a tight-fitting lid (or foil). Turn the heat to medium and cook for 6 mins.\r\nUncover and stir to incorporate the dry top layer of pasta. Push the mussels into the pasta so the hinges are buried in the bottom of the dish, and they stand straight up. Arrange the prawns on top, cover tightly and cook for another 6 mins or until the mussels are open, the prawns are pink and the pasta is cooked through. Leave to simmer for another 2-3 mins to cook off most of the remaining liquid (leave a little in the pan to prevent the pasta from sticking together). Allow to sit for 2-3 mins, then squeeze over the lemon juice and arrange the wedges on top. Scatter with parsley before serving.",
    "isApproved": true
  },
  {
    "title": "Egg Drop Soup",
    "keyIngredients": [
      "Chicken Stock",
      "Salt",
      "Sugar",
      "Pepper",
      "Sesame Seed Oil",
      "Peas",
      "Mushrooms",
      "Cornstarch",
      "Water",
      "Spring Onions",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/1529446137.jpg",
    "instructions": "In a wok add chicken broth and wait for it to boil.\r\nNext add salt, sugar, white pepper, sesame seed oil.\r\nWhen the chicken broth is boiling add the vegetables to the wok.\r\nTo thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your soup until it's the right thickness.\r\nNext add 1 egg slightly beaten with a knife or fork and add it to the soup slowly and stir for 8 seconds\r\nServe the soup in a bowl and add the green onions on top.",
    "isApproved": true
  },
  {
    "title": "Kung Po Prawns",
    "keyIngredients": [
      "Prawns",
      "Soy Sauce",
      "Tomato Puree",
      "Corn Flour",
      "Caster Sugar",
      "Sunflower Oil",
      "Peanuts",
      "Chilli",
      "Brown Sugar",
      "Garlic Clove",
      "Water Chestnut",
      "Ginger",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/1525873040.jpg",
    "instructions": "Mix the cornflour and 1 tbsp soy sauce, toss in the prawns and set aside for 10 mins. Stir the vinegar, remaining soy sauce, tomato purée, sugar and 2 tbsp water together to make a sauce.\r\n\r\nWhen you’re ready to cook, heat a large frying pan or wok until very hot, then add 1 tbsp oil. Fry the prawns until they are golden in places and have opened out– then tip them out of the pan.\r\n\r\nHeat the remaining oil and add the peanuts, chillies and water chestnuts. Stir-fry for 2 mins or until the peanuts start to colour, then add the ginger and garlic and fry for 1 more min. Tip in the prawns and sauce and simmer for 2 mins until thickened slightly. Serve with rice.",
    "isApproved": true
  },
  {
    "title": "Budino Di Ricotta",
    "keyIngredients": [
      "Ricotta",
      "Eggs",
      "Flour",
      "Sugar",
      "Cinnamon",
      "Lemons",
      "Dark Rum",
      "Icing Sugar",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/1549542877.jpg",
    "instructions": "Mash the ricotta and beat well with the egg yolks, stir in the flour, sugar, cinnamon, grated lemon rind and the rum and mix well. You can do this in a food processor. Beat the egg whites until stiff, fold in and pour into a buttered and floured 25cm cake tin. Bake in the oven at 180ºC/160ºC fan/gas 4 for about 40 minutes, or until it is firm.\r\n\r\nServe hot or cold dusted with icing sugar.",
    "isApproved": true
  },
  {
    "title": "General Tso's Chicken",
    "keyIngredients": [
      "Chicken Breast",
      "Plain Flour",
      "Egg",
      "Starch",
      "Baking Powder",
      "Salt",
      "Onion Salt",
      "Garlic Powder",
      "Water",
      "Chicken Stock",
      "Duck Sauce",
      "Soy Sauce",
      "Honey",
      "Rice Vinegar",
      "Sesame Seed Oil",
      "Gochujang",
      "Starch",
      "Garlic",
      "Spring Onions",
      "Ginger"
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/1529444113.jpg",
    "instructions": "DIRECTIONS:\r\nSTEP 1 - SAUCE\r\nIn a bowl, add 2 Cups of water, 2 Tablespoon soy sauce, 2 Tablespoon white vinegar, sherry cooking wine, 1/4 Teaspoon white pepper, minced ginger, minced garlic, hot pepper, ketchup, hoisin sauce, and sugar.\r\nMix together well and set aside.\r\nSTEP 2 - MARINATING THE CHICKEN\r\nIn a bowl, add the chicken, 1 pinch of salt, 1 pinch of white pepper, 2 egg whites, and 3 Tablespoon of corn starch\r\nSTEP 3 - DEEP FRY THE CHICKEN\r\nDeep fry the chicken at 350 degrees for 3-4 minutes or until it is golden brown and loosen up the chicken so that they don't stick together.\r\nSet the chicken aside.\r\nSTEP 4 - STIR FRY\r\nAdd the sauce to the wok and then the broccoli and wait until it is boiling.\r\nTo thicken the sauce, whisk together 2 Tablespoon of cornstarch and 4 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.\r\nNext add in the chicken and stir-fry for a minute and serve on a plate",
    "isApproved": true
  },
  {
    "title": "Brown Stew Chicken",
    "keyIngredients": [
      "Chicken",
      "Tomato",
      "Onions",
      "Garlic Clove",
      "Red Pepper",
      "Carrots",
      "Lime",
      "Thyme",
      "Allspice",
      "Soy Sauce",
      "Cornstarch",
      "Coconut Milk",
      "Vegetable Oil",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/sypxpx1515365095.jpg",
    "instructions": "Squeeze lime over chicken and rub well. Drain off excess lime juice.\r\nCombine tomato, scallion, onion, garlic, pepper, thyme, pimento and soy sauce in a large bowl with the chicken pieces. Cover and marinate at least one hour.\r\nHeat oil in a dutch pot or large saucepan. Shake off the seasonings as you remove each piece of chicken from the marinade. Reserve the marinade for sauce.\r\nLightly brown the chicken a few pieces at a time in very hot oil. Place browned chicken pieces on a plate to rest while you brown the remaining pieces.\r\nDrain off excess oil and return the chicken to the pan. Pour the marinade over the chicken and add the carrots. Stir and cook over medium heat for 10 minutes.\r\nMix flour and coconut milk and add to stew, stirring constantly. Turn heat down to minimum and cook another 20 minutes or until tender.",
    "isApproved": true
  },
  {
    "title": "Stovetop Eggplant With Harissa, Chickpeas, and Cumin Yogurt",
    "keyIngredients": [
      "Olive Oil",
      "Egg Plants",
      "Harissa",
      "Chickpeas",
      "Cherry Tomatoes",
      "Greek yogurt",
      "Ground cumin",
      "Parsley",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/yqwtvu1487426027.jpg",
    "instructions": "Heat the oil in a 12-inch skillet over high heat until shimmering. Add the eggplants and lower the heat to medium. Season with salt and pepper as you rotate the eggplants, browning them on all sides. Continue to cook, turning regularly, until a fork inserted into the eggplant meets no resistance (you may have to stand them up on their fat end to finish cooking the thickest parts), about 20 minutes, lowering the heat and sprinkling water into the pan as necessary if the eggplants threaten to burn or smoke excessively.\r\n\r\n2.\r\nMix the harissa, chickpeas and tomatoes together, then add to the eggplants. Cook until the tomatoes have blistered and broken down, about 5 minutes more. Season with salt and pepper and add water as necessary to thin to a saucy consistency. Meanwhile, combine the yogurt and cumin in a serving bowl. Season with salt and pepper.\r\n\r\n3.\r\nTop the eggplant mixture with the parsley, drizzle with more extra virgin olive oil, and serve with the yogurt on the side.",
    "isApproved": true
  },
  {
    "title": "Tourtiere",
    "keyIngredients": [
      "Potatoes",
      "Sunflower Oil",
      "Minced Pork",
      "Onion",
      "Garlic Clove",
      "Cinnamon",
      "Allspice",
      "Nutmeg",
      "Vegetable Stock",
      "Shortcrust Pastry",
      "Egg",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/ytpstt1511814614.jpg",
    "instructions": "Heat oven to 200C/180C fan/gas 6. Boil the potato until tender, drain and mash, then leave to cool. Heat the oil in a non-stick pan, add the mince and onion and quickly fry until browned. Add the garlic, spices, stock, plenty of pepper and a little salt and mix well. Remove from the heat, stir into the potato and leave to cool.\r\nRoll out half the pastry and line the base of a 20-23cm pie plate or flan tin. Fill with the pork mixture and brush the edges of the pastry with water. Roll out the remaining dough and cover the pie. Press the edges of the pastry to seal, trimming off the excess. Prick the top of the pastry case to allow steam to escape and glaze the top with the beaten egg.\r\nBake for 30 mins until the pastry is crisp and golden. Serve cut into wedges with a crisp green salad. Leftovers are good cold for lunch the next day, served with a selection of pickles.",
    "isApproved": true
  },
  {
    "title": "Chicken & mushroom Hotpot",
    "keyIngredients": [
      "Butter",
      "Onion",
      "Mushrooms",
      "Plain Flour",
      "Chicken Stock Cube",
      "Nutmeg",
      "Mustard Powder",
      "Chicken",
      "Sweetcorn",
      "Potatoes",
      "Butter",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/uuuspp1511297945.jpg",
    "instructions": "Heat oven to 200C/180C fan/gas 6. Put the butter in a medium-size saucepan and place over a medium heat. Add the onion and leave to cook for 5 mins, stirring occasionally. Add the mushrooms to the saucepan with the onions.\r\n\r\nOnce the onion and mushrooms are almost cooked, stir in the flour – this will make a thick paste called a roux. If you are using a stock cube, crumble the cube into the roux now and stir well. Put the roux over a low heat and stir continuously for 2 mins – this will cook the flour and stop the sauce from having a floury taste.\r\n\r\nTake the roux off the heat. Slowly add the fresh stock, if using, or pour in 500ml water if you’ve used a stock cube, stirring all the time. Once all the liquid has been added, season with pepper, a pinch of nutmeg and mustard powder. Put the saucepan back onto a medium heat and slowly bring it to the boil, stirring all the time. Once the sauce has thickened, place on a very low heat. Add the cooked chicken and vegetables to the sauce and stir well. Grease a medium-size ovenproof pie dish with a little butter and pour in the chicken and mushroom filling.\r\n\r\nCarefully lay the potatoes on top of the hot-pot filling, overlapping them slightly, almost like a pie top.\r\n\r\nBrush the potatoes with a little melted butter and cook in the oven for about 35 mins. The hot-pot is ready once the potatoes are cooked and golden brown.",
    "isApproved": true
  },
  {
    "title": "Hot and Sour Soup",
    "keyIngredients": [
      "Mushrooms",
      "Wood Ear Mushrooms",
      "Tofu",
      "Pork",
      "Chicken Stock",
      "Salt",
      "Sugar",
      "Sesame Seed Oil",
      "Pepper",
      "Hotsauce",
      "Vinegar",
      "Soy Sauce",
      "Cornstarch",
      "Water",
      "Spring Onions",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/1529445893.jpg",
    "instructions": "STEP 1 - MAKING THE SOUP\r\nIn a wok add chicken broth and wait for it to boil.\r\nNext add salt, sugar, sesame seed oil, white pepper, hot pepper sauce, vinegar and soy sauce and stir for few seconds.\r\nAdd Tofu, mushrooms, black wood ear mushrooms to the wok.\r\nTo thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your soup until it's the right thickness.\r\nNext add 1 egg slightly beaten with a knife or fork and add it to the soup and stir for 8 seconds\r\nServe the soup in a bowl and add the bbq pork and sliced green onions on top.",
    "isApproved": true
  },
  {
    "title": " Bubble & Squeak",
    "keyIngredients": [
      "Butter",
      "Bacon",
      "Onion",
      "Garlic Clove",
      "Brussels Sprouts",
      "Potatoes",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xusqvw1511638311.jpg",
    "instructions": "Melt the fat in a non-stick pan, allow it to get nice and hot, then add the bacon. As it begins to brown, add the onion and garlic. Next, add the sliced sprouts or cabbage and let it colour slightly. All this will take 5-6 mins.\r\nNext, add the potato. Work everything together in the pan and push it down so that the mixture covers the base of the pan – allow the mixture to catch slightly on the base of the pan before turning it over and doing the same again. It’s the bits of potato that catch in the pan that define the term ‘bubble and squeak’, so be brave and let the mixture colour. Cut into wedges and serve.",
    "isApproved": true
  },
  {
    "title": "Steak and Kidney Pie",
    "keyIngredients": [
      "Puff Pastry",
      "Egg White",
      "Egg Yolks",
      "Vegetable Oil",
      "Beef",
      "Lamb Kidney",
      "Onions",
      "Plain Flour",
      "Beef Stock",
      "Salt",
      "Pepper",
      "Worcestershire Sauce",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/qysyss1511558054.jpg",
    "instructions": "Preheat the oven to 220C/425F/Gas 7\r\nHeat the vegetable oil in a large frying pan, and brown the beef all over. (You may need to do this in batches.) Set aside, then brown the kidneys on both sides in the same pan. Add the onions and cook for 3-4 minutes.\r\nReturn the beef to the pan, sprinkle flour over and coat the meat and onions\r\nAdd the stock to the pan, stir well and bring to the boil.\r\nTurn the heat down and simmer for 1½ hours without a lid. If the liquid evaporates too much, add more stock.\r\nRemove from the heat. Add salt, pepper and Worcestershire sauce and allow to cool completely. Place the cooked meat mixture into a pie dish.\r\nRoll out the pastry to 5mm/¼in thick and 5cm/2in larger than the dish you are using.\r\nUsing a rolling pin, lift the pastry and place it over the top of the pie dish. Trim and crimp the edges with your fingers and thumb.\r\nBrush the surface with the beaten egg mixture and bake for 30-40 minutes until golden-brown and puffed.\r\nServe with creamy mash and steamed vegetables to soak up the gravy.",
    "isApproved": true
  },
  {
    "title": "McSinghs Scotch pie",
    "keyIngredients": [
      "Cumin",
      "Rapeseed Oil",
      "Red Onions",
      "Garlic Clove",
      "Green Chilli",
      "Red Pepper",
      "Nutmeg",
      "Coriander",
      "Lamb Mince",
      "Pepper",
      "Coriander",
      "Plain Flour",
      "Salt",
      "Milk",
      "Lard",
      "Egg Yolks",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/vssrtx1511557680.jpg",
    "instructions": "Heat a large frying pan and toast the cumin seeds for a few minutes, then set aside. Heat the oil in the same pan and fry the onion, garlic, chilli, pepper and a good pinch of salt for around eight minutes, until there is no moisture left. Remove from the heat, stir in the toasted cumin seeds, ground mace (or nutmeg) and ground coriander. Leave to cool.\r\nIn a large bowl mix together the minced lamb, white pepper, fresh coriander, and the cooled spiced onion mixture until combined. Set aside, covered, in the fridge.\r\nPreheat the oven to 200C/400F/Gas 6 and generously grease a 20cm/8in diameter loose-bottomed or springform round cake tin with lard.\r\nTo make the pastry, sift the flour and salt in a large bowl and make a well in the centre.\r\nPut the milk, lard and 90ml/3fl oz of water in a saucepan and heat gently. When the lard has melted, increase the heat and bring to the boil.\r\nPour the boiling liquid into the flour, and use a wooden spoon to combine until cool enough to handle. Bring together into a ball.\r\nDust a work surface with flour and, working quickly, knead the dough briefly – it will be soft and moist. Set aside a third of the pastry and roll the rest out on a well-floured surface. Line the pie dish with the pastry, pressing it right up the sides until it pokes just over the top of the tin.\r\nAdd the filling into the pastry-lined tin bit by bit. As you reach the top, form a slight peak. Roll out the reserved pastry and top the pie with it. Pinch the edges to seal and trim the excess. Poke a hole in the top of the pie and insert a small tube made from aluminium foil to allow steam to escape.\r\nBrush the top of the pie with a little beaten egg yolk, and bake in the preheated oven for 30 minutes (put a tray on the shelf below to catch any drips). Then reduce the temperature to 160C/325F/Gas 3 and cook for a further 1¼ hours until golden-brown. Leave to cool completely before refrigerating for two hours, or overnight.\r\nRun a knife around the edge of the pie, remove from the tin and serve with chutneys, salads or pickles.",
    "isApproved": true
  },
  {
    "title": "Potato Gratin with Chicken",
    "keyIngredients": [
      "Potatoes",
      "Onions",
      "Olive Oil",
      "Chicken Stock",
      "Creme Fraiche",
      "Parmesan",
      "Chicken Breasts",
      "Bacon",
      "Spinach",
      "Peas",
      "",
      "",
      "",
      "",
      "",
      null,
      null,
      null,
      null,
      null
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/qwrtut1468418027.jpg",
    "instructions": "15 minute potato gratin with chicken and bacon greens: a gratin always seems more effort and more indulgent than ordinary boiled or roasts, but it doesn't have to take 45mins, it's nice for a change and you can control the calorie content by going with full fat to low fat creme fraiche. (It's always tastes better full fat though obviously!) to serve 4: use 800g of potatoes, finely slice and boil in a pan for about 5-8 mins till firmish, not soft. Finely slice 3 onions and place in an oven dish with 2 tblsp of olive oil and 100ml of chicken stock. Cook till the onions are soft then drain the potatoes and pour onto the onions. Season and spoon over cream or creme fraiche till all is covered but not swimming. Grate Parmesan over the top then finish under the grill till nicely golden. serve with chicken and bacon, peas and spinach.",
    "isApproved": true
  },
  {
    "title": "Timbits",
    "keyIngredients": [
      "Flour",
      "Sugar",
      "Baking Powder",
      "Salt",
      "Egg",
      "Milk",
      "Oil",
      "Oil",
      "Icing Sugar",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/txsupu1511815755.jpg",
    "instructions": "Sift together dry ingredients.\r\nMix together wet ingredients and incorporate into dry. Stir until smooth.\r\nDrop by teaspoonfuls(no bigger) into hot oil (365 degrees, no hotter), turning after a few moments until golden brown on all sides.\r\nRemove and drain.\r\nRoll in cinnamon sugar while still warm and serve.",
    "isApproved": true
  },
  {
    "title": "Callaloo Jamaican Style",
    "keyIngredients": [
      "Kale",
      "Bacon",
      "Garlic",
      "Onion",
      "Paprika",
      "Thyme",
      "Tomato",
      "Red Pepper",
      "Banana",
      "Vegetable Oil",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/ussyxw1515364536.jpg",
    "instructions": "Cut leaves and soft stems from the kale branches, them soak in a bowl of cold water for about 5-10 minutes or until finish with prep.\r\nProceed to slicing the onions, mincing the garlic and dicing the tomatoes. Set aside\r\nRemove kale from water cut in chunks.\r\nPlace bacon on saucepan and cook until crispy. Then add onions, garlic, thyme, stir for about a minute or more\r\nAdd tomatoes; scotch bonnet pepper, smoked paprika. Sauté for about 2-3 more minutes.\r\nFinally add vegetable, salt, mix well, and steamed for about 6-8 minutes or until leaves are tender. Add a tiny bit of water as needed. Adjust seasonings and turn off the heat.\r\nUsing a sharp knife cut both ends off the plantain. This will make it easy to grab the skin of the plantains. Slit a shallow line down the long seam of the plantain; peel only as deep as the peel. Remove plantain peel by pulling it back.\r\nSlice the plantain into medium size lengthwise slices and set aside.\r\nCoat a large frying pan with cooking oil spray. Spray the tops of the plantains with a generous layer of oil spray and sprinkle with salt, freshly ground pepper.\r\nLet the plantains \"fry\" on medium heat, shaking the frying pan to redistribute them every few minutes.\r\nAs the plantains brown, continue to add more cooking oil spray, salt and pepper (if needed) until they have reached the desired color and texture.\r\nRemove and serve with kale",
    "isApproved": true
  },
  {
    "title": "Chicken Basquaise",
    "keyIngredients": [
      "Chicken",
      "Butter",
      "Olive Oil",
      "Red Onions",
      "Red Pepper",
      "Chorizo",
      "Sun-Dried Tomatoes",
      "Garlic",
      "Basmati Rice",
      "Tomato Puree",
      "Paprika",
      "Bay Leaves",
      "Thyme",
      "Chicken Stock",
      "Dry White Wine",
      "Lemons",
      "Black Olives",
      "Salt",
      "Pepper",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wruvqv1511880994.jpg",
    "instructions": "Preheat the oven to 180°C/Gas mark 4. Have the chicken joints ready to cook. Heat the butter and 3 tbsp olive oil in a flameproof casserole or large frying pan. Brown the chicken pieces in batches on both sides, seasoning them with salt and pepper as you go. Don't crowd the pan - fry the chicken in small batches, removing the pieces to kitchen paper as they are done.\r\n\r\nAdd a little more olive oil to the casserole and fry the onions over a medium heat for 10 minutes, stirring frequently, until softened but not browned. Add the rest of the oil, then the peppers and cook for another 5 minutes.\r\n\r\nAdd the chorizo, sun-dried tomatoes and garlic and cook for 2-3 minutes. Add the rice, stirring to ensure it is well coated in the oil. Stir in the tomato paste, paprika, bay leaves and chopped thyme. Pour in the stock and wine. When the liquid starts to bubble, turn the heat down to a gentle simmer. Press the rice down into the liquid if it isn't already submerged and place the chicken on top. Add the lemon wedges and olives around the chicken.\r\n\r\nCover and cook in the oven for 50 minutes. The rice should be cooked but still have some bite, and the chicken should have juices that run clear when pierced in the thickest part with a knife. If not, cook for another 5 minutes and check again.",
    "isApproved": true
  },
  {
    "title": "Beef stroganoff",
    "keyIngredients": [
      "Olive Oil",
      "Onions",
      "Garlic",
      "Butter",
      "Mushrooms",
      "Beef Fillet",
      "Plain Flour",
      "Creme Fraiche",
      "English Mustard",
      "Beef Stock",
      "Parsley",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/svprys1511176755.jpg",
    "instructions": "Heat the olive oil in a non-stick frying pan then add the sliced onion and cook on a medium heat until completely softened, so around 15 mins, adding a little splash of water if they start to stick at all. Crush in the garlic and cook for a 2-3 mins further, then add the butter. Once the butter is foaming a little, add the mushrooms and cook for around 5 mins until completely softened. Season everything well, then tip onto a plate.\r\nTip the flour into a bowl with a big pinch of salt and pepper, then toss the steak in the seasoned flour. Add the steak pieces to the pan, splashing in a little oil if the pan looks particularly dry, and fry for 3-4 mins, until well coloured. Tip the onions and mushrooms back into the pan. Whisk the crème fraîche, mustard and beef stock together, then pour into the pan. Cook over a medium heat for around 5 mins. Scatter with parsley, then serve with pappardelle or rice.",
    "isApproved": true
  },
  {
    "title": "Blackberry Fool",
    "keyIngredients": [
      "Hazlenuts",
      "Butter",
      "Caster Sugar",
      "Lemon",
      "Plain Flour",
      "Baking Powder",
      "Blackberrys",
      "Sugar",
      "Caster Sugar",
      "Lemon Juice",
      "Double Cream",
      "Yogurt",
      "Mint",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/rpvptu1511641092.jpg",
    "instructions": "For the biscuits, preheat the oven to 200C/180C (fan)/Gas 6 and line two large baking trays with baking parchment. Scatter the nuts over a baking tray and roast in the oven for 6-8 minutes, or until golden-brown. Watch them carefully so that they don’t have a chance to burn. Remove from the oven, tip onto a board and leave to cool.\r\nPut the butter and sugar in a large bowl and beat with a wooden spoon until light and creamy. Roughly chop the cooled nuts and add to the creamed butter and sugar, along with the lemon zest, flour and baking powder. Stir well until the mixture comes together and forms a ball – you may need to use your hands.\r\nDivide the biscuit dough into 24 even pieces and roll into small balls. Place the balls the prepared baking trays, spaced well apart to allow for spreading.\r\nPress the biscuits to flatten to around 1cm/½in thick. Bake the biscuits, one tray at a time, for 12 minutes or until very pale golden-brown. Leave to cool on the trays. They will be very soft when you take them out of the oven, but will crisp as they cool.\r\nStore in an airtight tin and eat within five days.\r\nFor the fool, rinse the blackberries in a colander to wash away any dust or dirt. Put the blackberries in a non-stick saucepan and sprinkle over the caster sugar.\r\nStir in the lemon juice and heat gently for two minutes, or until the blackberries begin to soften and release their juices. Remove and reserve 12 blackberries for decoration and continue cooking the rest.\r\nSimmer the blackberries very gently for 15 minutes, stirring regularly until very soft and squidgy. Remove from the heat and press the berries and juice through a sieve over a bowl, using the bottom of a ladle to help you extract as much of the purée as possible. Leave the purée to cool and discard the seeds. You should end up with around 325ml/11fl oz of purée.\r\nPut the cream and yoghurt in a large bowl and whip with an electric whisk until soft peaks form when the whisk is removed from the bowl – the acidity of the fruit will thicken the cream further, so don’t take it too far.\r\nWhen the purée is completely cold, adjust the sweetness to taste by adding more sugar if needed. Pour it into the bowl with the whipped cream and yoghurt and stir just once or twice until very lightly combined.\r\nSpoon the blackberry fool into individual wide, glass dishes – or one large, single bowl. It should look quite marbled, so don’t over-stir it. Scatter a few tiny mint leaves on top and decorate with the reserved blackberries. Sprinkle with a little sugar if you like and serve with the hazelnut biscuits.",
    "isApproved": true
  },
  {
    "title": "Clam chowder",
    "keyIngredients": [
      "Clams",
      "Butter",
      "Bacon",
      "Onion",
      "Thyme",
      "Bay Leaf",
      "Plain Flour",
      "Milk",
      "Double Cream",
      "Potatoes",
      "Parsley",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/rvtvuw1511190488.jpg",
    "instructions": "Rinse the clams in several changes of cold water and drain well. Tip the clams into a large pan with 500ml of water. Cover, bring to the boil and simmer for 2 mins until the clams have just opened. Tip the contents of the pan into a colander over a bowl to catch the clam stock. When cool enough to handle, remove the clams from their shells – reserving a handful of empty shells for presentation if you want. Strain the clam stock into a jug, leaving any grit in the bottom of the bowl. You should have around 800ml stock.\r\nHeat the butter in the same pan and sizzle the bacon for 3-4 mins until it starts to brown. Stir in the onion, thyme and bay and cook everything gently for 10 mins until the onion is soft and golden. Scatter over the flour and stir in to make a sandy paste, cook for 2 mins more, then gradually stir in the clam stock then the milk and the cream.\r\nThrow in the potatoes, bring everything to a simmer and leave to bubble away gently for 10 mins or until the potatoes are cooked. Use a fork to crush a few of the potato chunks against the side of the pan to help thicken – you still want lots of defined chunks though. Stir through the clam meat and the few clam shells, if you've gone down that route, and simmer for a minute to reheat. Season with plenty of black pepper and a little salt, if needed, then stir through the parsley just before ladling into bowls or hollowed-out crusty rolls.",
    "isApproved": true
  },
  {
    "title": "Lancashire hotpot",
    "keyIngredients": [
      "Butter",
      "Lamb",
      "Lamb Kidney",
      "Onions",
      "Carrots",
      "Plain Flour",
      "Worcestershire Sauce",
      "Chicken Stock",
      "Bay Leaves",
      "Potatoes",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/uttrxw1511637813.jpg",
    "instructions": "Heat oven to 160C/fan 140C/gas 3. Heat some dripping or butter in a large shallow casserole dish, brown the lamb in batches, lift to a plate, then repeat with the kidneys.\r\nFry the onions and carrots in the pan with a little more dripping until golden. Sprinkle over the flour, allow to cook for a couple of mins, shake over the Worcestershire sauce, pour in the stock, then bring to the boil. Stir in the meat and bay leaves, then turn off the heat. Arrange the sliced potatoes on top of the meat, then drizzle with a little more dripping. Cover, then place in the oven for about 1½ hrs until the potatoes are cooked.\r\nRemove the lid, brush the potatoes with a little more dripping, then turn the oven up to brown the potatoes, or finish under the grill for 5-8 mins until brown.",
    "isApproved": true
  },
  {
    "title": "Kentucky Fried Chicken",
    "keyIngredients": [
      "Chicken",
      "Oil",
      "Egg White",
      "Flour",
      "Brown Sugar",
      "Salt",
      "paprika",
      "onion salt",
      "chili powder",
      "black pepper",
      "celery salt",
      "sage",
      "garlic powder",
      "allspice",
      "oregano",
      "basil",
      "marjoram",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xqusqy1487348868.jpg",
    "instructions": "Preheat fryer to 350°F. Thoroughly mix together all the spice mix ingredients.\r\nCombine spice mix with flour, brown sugar and salt.\r\nDip chicken pieces in egg white to lightly coat them, then transfer to flour mixture. Turn a few times and make sure the flour mix is really stuck to the chicken. Repeat with all the chicken pieces.\r\nLet chicken pieces rest for 5 minutes so crust has a chance to dry a bit.\r\nFry chicken in batches. Breasts and wings should take 12-14 minutes, and legs and thighs will need a few more minutes. Chicken pieces are done when a meat thermometer inserted into the thickest part reads 165°F.\r\nLet chicken drain on a few paper towels when it comes out of the fryer. Serve hot.",
    "isApproved": true
  },
  {
    "title": "Ribollita",
    "keyIngredients": [
      "Olive Oil",
      "Onion",
      "Carrot",
      "Celery",
      "Garlic",
      "Cannellini Beans",
      "Canned tomatoes",
      "Water",
      "Rosemary",
      "Thyme",
      "Kale",
      "Wholegrain Bread",
      "Red Onion",
      "Parmesan",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/xrrwpx1487347049.jpg",
    "instructions": "Put 2 tablespoons of the oil in a large pot over medium heat. When it’s hot, add onion, carrot, celery and garlic; sprinkle with salt and pepper and cook, stirring occasionally, until vegetables are soft, 5 to 10 minutes.\r\nHeat the oven to 500 degrees. Drain the beans; if they’re canned, rinse them as well. Add them to the pot along with tomatoes and their juices and stock, rosemary and thyme. Bring to a boil, then reduce heat so the soup bubbles steadily; cover and cook, stirring once or twice to break up the tomatoes, until the flavors meld, 15 to 20 minutes.\r\nFish out and discard rosemary and thyme stems, if you like, and stir in kale. Taste and adjust seasoning. Lay bread slices on top of the stew so they cover the top and overlap as little as possible. Scatter red onion slices over the top, drizzle with the remaining 3 tablespoons oil and sprinkle with Parmesan.\r\nPut the pot in the oven and bake until the bread, onions and cheese are browned and crisp, 10 to 15 minutes. (If your pot fits under the broiler, you can also brown the top there.) Divide the soup and bread among 4 bowls and serve.",
    "isApproved": true
  },
  {
    "title": "Spanish Tortilla",
    "keyIngredients": [
      "Onion",
      "Olive Oil",
      "Butter",
      "Potatoes",
      "Garlic",
      "Eggs",
      "Parsley",
      "Baguette",
      "Vine Tomatoes",
      "Olive Oil",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/quuxsx1511476154.jpg",
    "instructions": "Put a large non-stick frying pan on a low heat. Cook the onion slowly in the oil and butter until soft but not brown – this should take about 15 mins. Add the potatoes, cover the pan and cook for a further 15-20 mins, stirring occasionally to make sure they fry evenly.\r\nWhen the potatoes are soft and the onion is shiny, crush 2 garlic cloves and stir in, followed by the beaten eggs.\r\nPut the lid back on the pan and leave the tortilla to cook gently. After 20 mins, the edges and base should be golden, the top set but the middle still a little wobbly. To turn it over, slide it onto a plate and put another plate on top, turn the whole thing over and slide it back into the pan to finish cooking. Once cooked, transfer to a plate and serve the tortilla warm or cold, scattered with the chopped parsley.\r\nTo accompany, take slices of warmed baguette, stab all over with a fork and rub with the remaining garlic, pile on grated tomatoes and season with sea salt and a drizzle of olive oil.",
    "isApproved": true
  },
  {
    "title": "Lasagne",
    "keyIngredients": [
      "Olive Oil",
      "Bacon",
      "Onion",
      "Celery",
      "Carrots",
      "Garlic",
      "Minced Beef",
      "Tomato Puree",
      "Chopped Tomatoes",
      "Honey",
      "Lasagne Sheets",
      "Creme Fraiche",
      "Mozzarella Balls",
      "Parmesan Cheese",
      "Basil Leaves",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/wtsvxx1511296896.jpg",
    "instructions": "Heat the oil in a large saucepan. Use kitchen scissors to snip the bacon into small pieces, or use a sharp knife to chop it on a chopping board. Add the bacon to the pan and cook for just a few mins until starting to turn golden. Add the onion, celery and carrot, and cook over a medium heat for 5 mins, stirring occasionally, until softened.\r\nAdd the garlic and cook for 1 min, then tip in the mince and cook, stirring and breaking it up with a wooden spoon, for about 6 mins until browned all over.\r\nStir in the tomato purée and cook for 1 min, mixing in well with the beef and vegetables. Tip in the chopped tomatoes. Fill each can half full with water to rinse out any tomatoes left in the can, and add to the pan. Add the honey and season to taste. Simmer for 20 mins.\r\nHeat oven to 200C/180C fan/gas 6. To assemble the lasagne, ladle a little of the ragu sauce into the bottom of the roasting tin or casserole dish, spreading the sauce all over the base. Place 2 sheets of lasagne on top of the sauce overlapping to make it fit, then repeat with more sauce and another layer of pasta. Repeat with a further 2 layers of sauce and pasta, finishing with a layer of pasta.\r\nPut the crème fraîche in a bowl and mix with 2 tbsp water to loosen it and make a smooth pourable sauce. Pour this over the top of the pasta, then top with the mozzarella. Sprinkle Parmesan over the top and bake for 25–30 mins until golden and bubbling. Serve scattered with basil, if you like.",
    "isApproved": true
  },
  {
    "title": "White chocolate creme brulee",
    "keyIngredients": [
      "Double Cream",
      "White Chocolate Chips",
      "Vanilla",
      "Egg Yolks",
      "Caster Sugar",
      "Caster Sugar",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/uryqru1511798039.jpg",
    "instructions": "Heat the cream, chocolate and vanilla pod in a pan until the chocolate has melted. Take off the heat and allow to infuse for 10 mins, scraping the pod seeds into the cream. If using the vanilla extract, add straight away. Heat oven to 160C/fan 140C/gas 3.\r\nBeat yolks and sugar until pale. stir in the chocolate cream. Strain into a jug and pour into ramekins. Place in a deep roasting tray and pour boiling water halfway up the sides. Bake for 15-20 mins until just set with a wobbly centre. Chill in the fridge for at least 4 hrs.\r\nTo serve, sprinkle some sugar on top of the brûlées and caramelise with a blowtorch or briefly under a hot grill. Leave caramel to harden, then serve.",
    "isApproved": true
  },
  {
    "title": "Stovetop Eggplant With Harissa, Chickpeas, and Cumin Yogurt",
    "keyIngredients": [
      "Olive Oil",
      "Egg Plants",
      "Harissa",
      "Chickpeas",
      "Cherry Tomatoes",
      "Greek yogurt",
      "Ground cumin",
      "Parsley",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/yqwtvu1487426027.jpg",
    "instructions": "Heat the oil in a 12-inch skillet over high heat until shimmering. Add the eggplants and lower the heat to medium. Season with salt and pepper as you rotate the eggplants, browning them on all sides. Continue to cook, turning regularly, until a fork inserted into the eggplant meets no resistance (you may have to stand them up on their fat end to finish cooking the thickest parts), about 20 minutes, lowering the heat and sprinkling water into the pan as necessary if the eggplants threaten to burn or smoke excessively.\r\n\r\n2.\r\nMix the harissa, chickpeas and tomatoes together, then add to the eggplants. Cook until the tomatoes have blistered and broken down, about 5 minutes more. Season with salt and pepper and add water as necessary to thin to a saucy consistency. Meanwhile, combine the yogurt and cumin in a serving bowl. Season with salt and pepper.\r\n\r\n3.\r\nTop the eggplant mixture with the parsley, drizzle with more extra virgin olive oil, and serve with the yogurt on the side.",
    "isApproved": true
  },
  {
    "title": "Chicken Karaage",
    "keyIngredients": [
      "Chicken thigh",
      "Ginger",
      "Garlic",
      "Soy sauce",
      "Sake",
      "Granulated sugar",
      "Potato starch",
      "Vegetable oil",
      "Lemon",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/tyywsw1505930373.jpg",
    "instructions": "Add the ginger, garlic, soy sauce, sake and sugar to a bowl and whisk to combine. Add the chicken, then stir to coat evenly. Cover and refrigerate for at least 1 hour.\r\n\r\nAdd 1 inch of vegetable oil to a heavy bottomed pot and heat until the oil reaches 360 degrees F. Line a wire rack with 2 sheets of paper towels and get your tongs out. Put the potato starch in a bowl\r\n\r\nAdd a handful of chicken to the potato starch and toss to coat each piece evenly.\r\n\r\nFry the karaage in batches until the exterior is a medium brown and the chicken is cooked through. Transfer the fried chicken to the paper towel lined rack. If you want the karaage to stay crispy longer, you can fry the chicken a second time, until it's a darker color after it's cooled off once. Serve with lemon wedges.",
    "isApproved": true
  },
  {
    "title": "Chicken Fajita Mac and Cheese",
    "keyIngredients": [
      "macaroni",
      "chicken stock",
      "heavy cream",
      "fajita seasoning",
      "salt",
      "chicken breast",
      "olive oil",
      "onion",
      "red pepper",
      "garlic",
      "cheddar cheese",
      "parsley",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    "servings": 0,
    "prepTime": "",
    "picture": "https://www.themealdb.com/images/media/meals/qrqywr1503066605.jpg",
    "instructions": "Fry your onion, peppers and garlic in olive oil until nicely translucent. Make a well in your veg and add your chicken. Add your seasoning and salt. Allow to colour slightly.\r\nAdd your cream, stock and macaroni.\r\nCook on low for 20 minutes. Add your cheeses, stir to combine.\r\nTop with roasted peppers and parsley.",
    "isApproved": true
  }
]
